espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** SDIO_SLC_CONF0_REG register
 *  Sdio slave DMA configuration register.
 */
#define SDIO_SLC_CONF0_REG (DR_REG_SLC_BASE + 0x0)
/** SDIO_SLC0_TX_RST : R/W; bitpos: [0]; default: 0;
 *  Set 1 to reset receiving fsm in dma channel0.
 */
#define SDIO_SLC0_TX_RST    (BIT(0))
#define SDIO_SLC0_TX_RST_M  (SDIO_SLC0_TX_RST_V << SDIO_SLC0_TX_RST_S)
#define SDIO_SLC0_TX_RST_V  0x00000001U
#define SDIO_SLC0_TX_RST_S  0
/** SDIO_SLC0_RX_RST : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset transmitting fsm in dma channel0.
 */
#define SDIO_SLC0_RX_RST    (BIT(1))
#define SDIO_SLC0_RX_RST_M  (SDIO_SLC0_RX_RST_V << SDIO_SLC0_RX_RST_S)
#define SDIO_SLC0_RX_RST_V  0x00000001U
#define SDIO_SLC0_RX_RST_S  1
/** SDIO_SLC_AHBM_FIFO_RST : R/W; bitpos: [2]; default: 0;
 *  reset the command fifo of AHB bus of sdio slave
 */
#define SDIO_SLC_AHBM_FIFO_RST    (BIT(2))
#define SDIO_SLC_AHBM_FIFO_RST_M  (SDIO_SLC_AHBM_FIFO_RST_V << SDIO_SLC_AHBM_FIFO_RST_S)
#define SDIO_SLC_AHBM_FIFO_RST_V  0x00000001U
#define SDIO_SLC_AHBM_FIFO_RST_S  2
/** SDIO_SLC_AHBM_RST : R/W; bitpos: [3]; default: 0;
 *  reset the AHB bus of sdio slave
 */
#define SDIO_SLC_AHBM_RST    (BIT(3))
#define SDIO_SLC_AHBM_RST_M  (SDIO_SLC_AHBM_RST_V << SDIO_SLC_AHBM_RST_S)
#define SDIO_SLC_AHBM_RST_V  0x00000001U
#define SDIO_SLC_AHBM_RST_S  3
/** SDIO_SLC0_TX_LOOP_TEST : R/W; bitpos: [4]; default: 0;
 *  Loop around when the slave buffer finishes receiving packets. When set to 1,
 *  hardware will not change the owner bit in the linked list.
 */
#define SDIO_SLC0_TX_LOOP_TEST    (BIT(4))
#define SDIO_SLC0_TX_LOOP_TEST_M  (SDIO_SLC0_TX_LOOP_TEST_V << SDIO_SLC0_TX_LOOP_TEST_S)
#define SDIO_SLC0_TX_LOOP_TEST_V  0x00000001U
#define SDIO_SLC0_TX_LOOP_TEST_S  4
/** SDIO_SLC0_RX_LOOP_TEST : R/W; bitpos: [5]; default: 0;
 *  Loop around when the slave buffer finishes sending packets. When set to 1, hardware
 *  will not change the owner bit in the linked list.
 */
#define SDIO_SLC0_RX_LOOP_TEST    (BIT(5))
#define SDIO_SLC0_RX_LOOP_TEST_M  (SDIO_SLC0_RX_LOOP_TEST_V << SDIO_SLC0_RX_LOOP_TEST_S)
#define SDIO_SLC0_RX_LOOP_TEST_V  0x00000001U
#define SDIO_SLC0_RX_LOOP_TEST_S  5
/** SDIO_SLC0_RX_AUTO_WRBACK : R/W; bitpos: [6]; default: 0;
 *  Set 1 to enable change the owner bit of rx link descriptor
 */
#define SDIO_SLC0_RX_AUTO_WRBACK    (BIT(6))
#define SDIO_SLC0_RX_AUTO_WRBACK_M  (SDIO_SLC0_RX_AUTO_WRBACK_V << SDIO_SLC0_RX_AUTO_WRBACK_S)
#define SDIO_SLC0_RX_AUTO_WRBACK_V  0x00000001U
#define SDIO_SLC0_RX_AUTO_WRBACK_S  6
/** SDIO_SLC0_RX_NO_RESTART_CLR : R/W; bitpos: [7]; default: 0;
 *  Set this bit to disable the function that when slave starts to send data to host,
 *  the slc0_bt_rx_new_packet_int_raw or slc0_host_rd_retry_int_raw will be
 *  automatically cleared.
 */
#define SDIO_SLC0_RX_NO_RESTART_CLR    (BIT(7))
#define SDIO_SLC0_RX_NO_RESTART_CLR_M  (SDIO_SLC0_RX_NO_RESTART_CLR_V << SDIO_SLC0_RX_NO_RESTART_CLR_S)
#define SDIO_SLC0_RX_NO_RESTART_CLR_V  0x00000001U
#define SDIO_SLC0_RX_NO_RESTART_CLR_S  7
/** SDIO_SLC0_RXDSCR_BURST_EN : R/W; bitpos: [8]; default: 1;
 *  0- AHB burst type is single when slave read rx-descriptor from memory through
 *  slc0,1-AHB burst type is not single when slave read rx-descriptor from memory
 *  through slc0
 */
#define SDIO_SLC0_RXDSCR_BURST_EN    (BIT(8))
#define SDIO_SLC0_RXDSCR_BURST_EN_M  (SDIO_SLC0_RXDSCR_BURST_EN_V << SDIO_SLC0_RXDSCR_BURST_EN_S)
#define SDIO_SLC0_RXDSCR_BURST_EN_V  0x00000001U
#define SDIO_SLC0_RXDSCR_BURST_EN_S  8
/** SDIO_SLC0_RXDATA_BURST_EN : R/W; bitpos: [9]; default: 1;
 *  0- AHB burst type is single when slave receives data from memory,1-AHB burst type
 *  is not single when slave receives data from memory
 */
#define SDIO_SLC0_RXDATA_BURST_EN    (BIT(9))
#define SDIO_SLC0_RXDATA_BURST_EN_M  (SDIO_SLC0_RXDATA_BURST_EN_V << SDIO_SLC0_RXDATA_BURST_EN_S)
#define SDIO_SLC0_RXDATA_BURST_EN_V  0x00000001U
#define SDIO_SLC0_RXDATA_BURST_EN_S  9
/** SDIO_SLC0_RXLINK_AUTO_RET : R/W; bitpos: [10]; default: 1;
 *  enable the function that when host reading packet retries, slc1 will automatically
 *  jump to the start descriptor of the previous packet.
 */
#define SDIO_SLC0_RXLINK_AUTO_RET    (BIT(10))
#define SDIO_SLC0_RXLINK_AUTO_RET_M  (SDIO_SLC0_RXLINK_AUTO_RET_V << SDIO_SLC0_RXLINK_AUTO_RET_S)
#define SDIO_SLC0_RXLINK_AUTO_RET_V  0x00000001U
#define SDIO_SLC0_RXLINK_AUTO_RET_S  10
/** SDIO_SLC0_TXLINK_AUTO_RET : R/W; bitpos: [11]; default: 1;
 *  enable the function that when host sending packet retries, slc1 will automatically
 *  jump to the start descriptor of the previous packet.
 */
#define SDIO_SLC0_TXLINK_AUTO_RET    (BIT(11))
#define SDIO_SLC0_TXLINK_AUTO_RET_M  (SDIO_SLC0_TXLINK_AUTO_RET_V << SDIO_SLC0_TXLINK_AUTO_RET_S)
#define SDIO_SLC0_TXLINK_AUTO_RET_V  0x00000001U
#define SDIO_SLC0_TXLINK_AUTO_RET_S  11
/** SDIO_SLC0_TXDSCR_BURST_EN : R/W; bitpos: [12]; default: 1;
 *  0- AHB burst type is single when slave read tx-descriptor from memory through
 *  slc0,1-AHB burst type is not single when slave read tx-descriptor from memory
 *  through slc0
 */
#define SDIO_SLC0_TXDSCR_BURST_EN    (BIT(12))
#define SDIO_SLC0_TXDSCR_BURST_EN_M  (SDIO_SLC0_TXDSCR_BURST_EN_V << SDIO_SLC0_TXDSCR_BURST_EN_S)
#define SDIO_SLC0_TXDSCR_BURST_EN_V  0x00000001U
#define SDIO_SLC0_TXDSCR_BURST_EN_S  12
/** SDIO_SLC0_TXDATA_BURST_EN : R/W; bitpos: [13]; default: 1;
 *  0- AHB burst type is single when slave send data to memory,1-AHB burst type is not
 *  single when slave send data to memory
 */
#define SDIO_SLC0_TXDATA_BURST_EN    (BIT(13))
#define SDIO_SLC0_TXDATA_BURST_EN_M  (SDIO_SLC0_TXDATA_BURST_EN_V << SDIO_SLC0_TXDATA_BURST_EN_S)
#define SDIO_SLC0_TXDATA_BURST_EN_V  0x00000001U
#define SDIO_SLC0_TXDATA_BURST_EN_S  13
/** SDIO_SLC0_TOKEN_AUTO_CLR : R/W; bitpos: [14]; default: 1;
 *  auto clear slc0_token1 enable
 */
#define SDIO_SLC0_TOKEN_AUTO_CLR    (BIT(14))
#define SDIO_SLC0_TOKEN_AUTO_CLR_M  (SDIO_SLC0_TOKEN_AUTO_CLR_V << SDIO_SLC0_TOKEN_AUTO_CLR_S)
#define SDIO_SLC0_TOKEN_AUTO_CLR_V  0x00000001U
#define SDIO_SLC0_TOKEN_AUTO_CLR_S  14
/** SDIO_SLC0_TOKEN_SEL : R/W; bitpos: [15]; default: 1;
 *  0: choose to save slc0_token0's value, 1: choose to save the accumulative value of
 *  slc0_token1
 */
#define SDIO_SLC0_TOKEN_SEL    (BIT(15))
#define SDIO_SLC0_TOKEN_SEL_M  (SDIO_SLC0_TOKEN_SEL_V << SDIO_SLC0_TOKEN_SEL_S)
#define SDIO_SLC0_TOKEN_SEL_V  0x00000001U
#define SDIO_SLC0_TOKEN_SEL_S  15
/** SDIO_SLC1_TX_RST : R/W; bitpos: [16]; default: 0;
 *  Set 1 to reset receiving fsm in dma slc0.
 */
#define SDIO_SLC1_TX_RST    (BIT(16))
#define SDIO_SLC1_TX_RST_M  (SDIO_SLC1_TX_RST_V << SDIO_SLC1_TX_RST_S)
#define SDIO_SLC1_TX_RST_V  0x00000001U
#define SDIO_SLC1_TX_RST_S  16
/** SDIO_SLC1_RX_RST : R/W; bitpos: [17]; default: 0;
 *  Set 1 to reset sending fsm in dma slc0.
 */
#define SDIO_SLC1_RX_RST    (BIT(17))
#define SDIO_SLC1_RX_RST_M  (SDIO_SLC1_RX_RST_V << SDIO_SLC1_RX_RST_S)
#define SDIO_SLC1_RX_RST_V  0x00000001U
#define SDIO_SLC1_RX_RST_S  17
/** SDIO_SLC0_WR_RETRY_MASK_EN : R/W; bitpos: [18]; default: 1;
 *  Set this bit to generate an interrupt when host sending retry finishes and prevent
 *  host still retrying after one successful retry through dma channel0
 */
#define SDIO_SLC0_WR_RETRY_MASK_EN    (BIT(18))
#define SDIO_SLC0_WR_RETRY_MASK_EN_M  (SDIO_SLC0_WR_RETRY_MASK_EN_V << SDIO_SLC0_WR_RETRY_MASK_EN_S)
#define SDIO_SLC0_WR_RETRY_MASK_EN_V  0x00000001U
#define SDIO_SLC0_WR_RETRY_MASK_EN_S  18
/** SDIO_SLC1_WR_RETRY_MASK_EN : R/W; bitpos: [19]; default: 1;
 *  Set this bit to generate an interrupt when host sending retry finishes and prevent
 *  host still retrying after one successful retry through dma channel0
 */
#define SDIO_SLC1_WR_RETRY_MASK_EN    (BIT(19))
#define SDIO_SLC1_WR_RETRY_MASK_EN_M  (SDIO_SLC1_WR_RETRY_MASK_EN_V << SDIO_SLC1_WR_RETRY_MASK_EN_S)
#define SDIO_SLC1_WR_RETRY_MASK_EN_V  0x00000001U
#define SDIO_SLC1_WR_RETRY_MASK_EN_S  19
/** SDIO_SLC1_TX_LOOP_TEST : R/W; bitpos: [20]; default: 1;
 *  owner control when slc1 writes back tx descriptor: 0- cpu is owner, 1-dma is owner.
 */
#define SDIO_SLC1_TX_LOOP_TEST    (BIT(20))
#define SDIO_SLC1_TX_LOOP_TEST_M  (SDIO_SLC1_TX_LOOP_TEST_V << SDIO_SLC1_TX_LOOP_TEST_S)
#define SDIO_SLC1_TX_LOOP_TEST_V  0x00000001U
#define SDIO_SLC1_TX_LOOP_TEST_S  20
/** SDIO_SLC1_RX_LOOP_TEST : R/W; bitpos: [21]; default: 1;
 *  owner control when slc1 writes back rx descriptor: 0- cpu is owner, 1-dma is owner.
 */
#define SDIO_SLC1_RX_LOOP_TEST    (BIT(21))
#define SDIO_SLC1_RX_LOOP_TEST_M  (SDIO_SLC1_RX_LOOP_TEST_V << SDIO_SLC1_RX_LOOP_TEST_S)
#define SDIO_SLC1_RX_LOOP_TEST_V  0x00000001U
#define SDIO_SLC1_RX_LOOP_TEST_S  21
/** SDIO_SLC1_RX_AUTO_WRBACK : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable change the owner bit of the transmitting buffer's linked list when
 *  transmitting data.
 */
#define SDIO_SLC1_RX_AUTO_WRBACK    (BIT(22))
#define SDIO_SLC1_RX_AUTO_WRBACK_M  (SDIO_SLC1_RX_AUTO_WRBACK_V << SDIO_SLC1_RX_AUTO_WRBACK_S)
#define SDIO_SLC1_RX_AUTO_WRBACK_V  0x00000001U
#define SDIO_SLC1_RX_AUTO_WRBACK_S  22
/** SDIO_SLC1_RX_NO_RESTART_CLR : R/W; bitpos: [23]; default: 0;
 *  Set this bit to disable the function that when slave starts to send data to host,
 *  the slc1_bt_rx_new_packet_int_raw, slc1_wifi_rx_new_packet_int_raw or
 *  slc1_host_rd_retry_int_raw will be automatically cleared.
 */
#define SDIO_SLC1_RX_NO_RESTART_CLR    (BIT(23))
#define SDIO_SLC1_RX_NO_RESTART_CLR_M  (SDIO_SLC1_RX_NO_RESTART_CLR_V << SDIO_SLC1_RX_NO_RESTART_CLR_S)
#define SDIO_SLC1_RX_NO_RESTART_CLR_V  0x00000001U
#define SDIO_SLC1_RX_NO_RESTART_CLR_S  23
/** SDIO_SLC1_RXDSCR_BURST_EN : R/W; bitpos: [24]; default: 1;
 *  0- AHB burst type is single when dma channel1 fetches linked list for sending
 *  data,1-AHB burst type is not single when dma channel1 fetches linked list for
 *  sending data
 */
#define SDIO_SLC1_RXDSCR_BURST_EN    (BIT(24))
#define SDIO_SLC1_RXDSCR_BURST_EN_M  (SDIO_SLC1_RXDSCR_BURST_EN_V << SDIO_SLC1_RXDSCR_BURST_EN_S)
#define SDIO_SLC1_RXDSCR_BURST_EN_V  0x00000001U
#define SDIO_SLC1_RXDSCR_BURST_EN_S  24
/** SDIO_SLC1_RXDATA_BURST_EN : R/W; bitpos: [25]; default: 1;
 *  0- AHB burst type is single when slave receives data through dma channel1,1-AHB
 *  burst type is not single when slave receives data through dma channel1
 */
#define SDIO_SLC1_RXDATA_BURST_EN    (BIT(25))
#define SDIO_SLC1_RXDATA_BURST_EN_M  (SDIO_SLC1_RXDATA_BURST_EN_V << SDIO_SLC1_RXDATA_BURST_EN_S)
#define SDIO_SLC1_RXDATA_BURST_EN_V  0x00000001U
#define SDIO_SLC1_RXDATA_BURST_EN_S  25
/** SDIO_SLC1_RXLINK_AUTO_RET : R/W; bitpos: [26]; default: 1;
 *  enable the function that when host reading packet retries, dma channel1 will
 *  automatically jump to the start descriptor of the previous packet.
 */
#define SDIO_SLC1_RXLINK_AUTO_RET    (BIT(26))
#define SDIO_SLC1_RXLINK_AUTO_RET_M  (SDIO_SLC1_RXLINK_AUTO_RET_V << SDIO_SLC1_RXLINK_AUTO_RET_S)
#define SDIO_SLC1_RXLINK_AUTO_RET_V  0x00000001U
#define SDIO_SLC1_RXLINK_AUTO_RET_S  26
/** SDIO_SLC1_TXLINK_AUTO_RET : R/W; bitpos: [27]; default: 1;
 *  enable the function that when host sending packet retries, dma channel1 will
 *  automatically jump to the start descriptor of the previous packet.
 */
#define SDIO_SLC1_TXLINK_AUTO_RET    (BIT(27))
#define SDIO_SLC1_TXLINK_AUTO_RET_M  (SDIO_SLC1_TXLINK_AUTO_RET_V << SDIO_SLC1_TXLINK_AUTO_RET_S)
#define SDIO_SLC1_TXLINK_AUTO_RET_V  0x00000001U
#define SDIO_SLC1_TXLINK_AUTO_RET_S  27
/** SDIO_SLC1_TXDSCR_BURST_EN : R/W; bitpos: [28]; default: 1;
 *  0- AHB burst type is single when dma channel1 fetches linked list for receiving
 *  data, 1-AHB burst type is not single when dma channel1 fetches linked list for
 *  receiving data
 */
#define SDIO_SLC1_TXDSCR_BURST_EN    (BIT(28))
#define SDIO_SLC1_TXDSCR_BURST_EN_M  (SDIO_SLC1_TXDSCR_BURST_EN_V << SDIO_SLC1_TXDSCR_BURST_EN_S)
#define SDIO_SLC1_TXDSCR_BURST_EN_V  0x00000001U
#define SDIO_SLC1_TXDSCR_BURST_EN_S  28
/** SDIO_SLC1_TXDATA_BURST_EN : R/W; bitpos: [29]; default: 1;
 *  0- AHB burst type is single when slave sends data to memory through dma channel1,
 *  1-AHB burst type is not single when slave sends data to memory through dma channel1.
 */
#define SDIO_SLC1_TXDATA_BURST_EN    (BIT(29))
#define SDIO_SLC1_TXDATA_BURST_EN_M  (SDIO_SLC1_TXDATA_BURST_EN_V << SDIO_SLC1_TXDATA_BURST_EN_S)
#define SDIO_SLC1_TXDATA_BURST_EN_V  0x00000001U
#define SDIO_SLC1_TXDATA_BURST_EN_S  29
/** SDIO_SLC1_TOKEN_SEL : R/W; bitpos: [31]; default: 1;
 *  reserved
 */
#define SDIO_SLC1_TOKEN_SEL    (BIT(31))
#define SDIO_SLC1_TOKEN_SEL_M  (SDIO_SLC1_TOKEN_SEL_V << SDIO_SLC1_TOKEN_SEL_S)
#define SDIO_SLC1_TOKEN_SEL_V  0x00000001U
#define SDIO_SLC1_TOKEN_SEL_S  31

