espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_reg.h
/** SDIO_SLC_SLC0INT_RAW_REG register
 *  Sdio slave DMA channel0 raw interrupt status register.
 */
#define SDIO_SLC_SLC0INT_RAW_REG (DR_REG_SLC_BASE + 0x4)
/** SDIO_SLC_FRHOST_BIT0_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit 0 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT0_INT_RAW    (BIT(0))
#define SDIO_SLC_FRHOST_BIT0_INT_RAW_M  (SDIO_SLC_FRHOST_BIT0_INT_RAW_V << SDIO_SLC_FRHOST_BIT0_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT0_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT0_INT_RAW_S  0
/** SDIO_SLC_FRHOST_BIT1_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit 1 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT1_INT_RAW    (BIT(1))
#define SDIO_SLC_FRHOST_BIT1_INT_RAW_M  (SDIO_SLC_FRHOST_BIT1_INT_RAW_V << SDIO_SLC_FRHOST_BIT1_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT1_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT1_INT_RAW_S  1
/** SDIO_SLC_FRHOST_BIT2_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit 2 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT2_INT_RAW    (BIT(2))
#define SDIO_SLC_FRHOST_BIT2_INT_RAW_M  (SDIO_SLC_FRHOST_BIT2_INT_RAW_V << SDIO_SLC_FRHOST_BIT2_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT2_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT2_INT_RAW_S  2
/** SDIO_SLC_FRHOST_BIT3_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit 3 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT3_INT_RAW    (BIT(3))
#define SDIO_SLC_FRHOST_BIT3_INT_RAW_M  (SDIO_SLC_FRHOST_BIT3_INT_RAW_V << SDIO_SLC_FRHOST_BIT3_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT3_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT3_INT_RAW_S  3
/** SDIO_SLC_FRHOST_BIT4_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit 4 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT4_INT_RAW    (BIT(4))
#define SDIO_SLC_FRHOST_BIT4_INT_RAW_M  (SDIO_SLC_FRHOST_BIT4_INT_RAW_V << SDIO_SLC_FRHOST_BIT4_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT4_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT4_INT_RAW_S  4
/** SDIO_SLC_FRHOST_BIT5_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt bit 5 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT5_INT_RAW    (BIT(5))
#define SDIO_SLC_FRHOST_BIT5_INT_RAW_M  (SDIO_SLC_FRHOST_BIT5_INT_RAW_V << SDIO_SLC_FRHOST_BIT5_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT5_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT5_INT_RAW_S  5
/** SDIO_SLC_FRHOST_BIT6_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt bit 6 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT6_INT_RAW    (BIT(6))
#define SDIO_SLC_FRHOST_BIT6_INT_RAW_M  (SDIO_SLC_FRHOST_BIT6_INT_RAW_V << SDIO_SLC_FRHOST_BIT6_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT6_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT6_INT_RAW_S  6
/** SDIO_SLC_FRHOST_BIT7_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt bit 7 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT7_INT_RAW    (BIT(7))
#define SDIO_SLC_FRHOST_BIT7_INT_RAW_M  (SDIO_SLC_FRHOST_BIT7_INT_RAW_V << SDIO_SLC_FRHOST_BIT7_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT7_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT7_INT_RAW_S  7
/** SDIO_SLC0_RX_START_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit of registering dma channel0 sending initialization
 */
#define SDIO_SLC0_RX_START_INT_RAW    (BIT(8))
#define SDIO_SLC0_RX_START_INT_RAW_M  (SDIO_SLC0_RX_START_INT_RAW_V << SDIO_SLC0_RX_START_INT_RAW_S)
#define SDIO_SLC0_RX_START_INT_RAW_V  0x00000001U
#define SDIO_SLC0_RX_START_INT_RAW_S  8
/** SDIO_SLC0_TX_START_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit of registering dma channel0 receiving initialization
 */
#define SDIO_SLC0_TX_START_INT_RAW    (BIT(9))
#define SDIO_SLC0_TX_START_INT_RAW_M  (SDIO_SLC0_TX_START_INT_RAW_V << SDIO_SLC0_TX_START_INT_RAW_S)
#define SDIO_SLC0_TX_START_INT_RAW_V  0x00000001U
#define SDIO_SLC0_TX_START_INT_RAW_S  9
/** SDIO_SLC0_RX_UDF_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt bit of dma channel0 sending buffer underflow.
 */
#define SDIO_SLC0_RX_UDF_INT_RAW    (BIT(10))
#define SDIO_SLC0_RX_UDF_INT_RAW_M  (SDIO_SLC0_RX_UDF_INT_RAW_V << SDIO_SLC0_RX_UDF_INT_RAW_S)
#define SDIO_SLC0_RX_UDF_INT_RAW_V  0x00000001U
#define SDIO_SLC0_RX_UDF_INT_RAW_S  10
/** SDIO_SLC0_TX_OVF_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw interrupt bit of dma channel0 receiving buffer overflow.
 */
#define SDIO_SLC0_TX_OVF_INT_RAW    (BIT(11))
#define SDIO_SLC0_TX_OVF_INT_RAW_M  (SDIO_SLC0_TX_OVF_INT_RAW_V << SDIO_SLC0_TX_OVF_INT_RAW_S)
#define SDIO_SLC0_TX_OVF_INT_RAW_V  0x00000001U
#define SDIO_SLC0_TX_OVF_INT_RAW_S  11
/** SDIO_SLC0_TOKEN0_1TO0_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw interrupt bit for the value of slc0_token0 becoming to zero.
 */
#define SDIO_SLC0_TOKEN0_1TO0_INT_RAW    (BIT(12))
#define SDIO_SLC0_TOKEN0_1TO0_INT_RAW_M  (SDIO_SLC0_TOKEN0_1TO0_INT_RAW_V << SDIO_SLC0_TOKEN0_1TO0_INT_RAW_S)
#define SDIO_SLC0_TOKEN0_1TO0_INT_RAW_V  0x00000001U
#define SDIO_SLC0_TOKEN0_1TO0_INT_RAW_S  12
/** SDIO_SLC0_TOKEN1_1TO0_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  The raw interrupt bit for the value of slc0_token1 becoming to zero.
 */
#define SDIO_SLC0_TOKEN1_1TO0_INT_RAW    (BIT(13))
#define SDIO_SLC0_TOKEN1_1TO0_INT_RAW_M  (SDIO_SLC0_TOKEN1_1TO0_INT_RAW_V << SDIO_SLC0_TOKEN1_1TO0_INT_RAW_S)
#define SDIO_SLC0_TOKEN1_1TO0_INT_RAW_V  0x00000001U
#define SDIO_SLC0_TOKEN1_1TO0_INT_RAW_S  13
/** SDIO_SLC0_TX_DONE_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  The raw interrupt bit of dma channel0 finishing receiving data to one single buffer.
 */
#define SDIO_SLC0_TX_DONE_INT_RAW    (BIT(14))
#define SDIO_SLC0_TX_DONE_INT_RAW_M  (SDIO_SLC0_TX_DONE_INT_RAW_V << SDIO_SLC0_TX_DONE_INT_RAW_S)
#define SDIO_SLC0_TX_DONE_INT_RAW_V  0x00000001U
#define SDIO_SLC0_TX_DONE_INT_RAW_S  14
/** SDIO_SLC0_TX_SUC_EOF_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  The raw interrupt bit of dma channel0 finishing receiving data
 */
#define SDIO_SLC0_TX_SUC_EOF_INT_RAW    (BIT(15))
#define SDIO_SLC0_TX_SUC_EOF_INT_RAW_M  (SDIO_SLC0_TX_SUC_EOF_INT_RAW_V << SDIO_SLC0_TX_SUC_EOF_INT_RAW_S)
#define SDIO_SLC0_TX_SUC_EOF_INT_RAW_V  0x00000001U
#define SDIO_SLC0_TX_SUC_EOF_INT_RAW_S  15
/** SDIO_SLC0_RX_DONE_INT_RAW : R/WTC/SS; bitpos: [16]; default: 0;
 *  The raw interrupt bit of dma channel0 finishing sending data from one single buffer
 */
#define SDIO_SLC0_RX_DONE_INT_RAW    (BIT(16))
#define SDIO_SLC0_RX_DONE_INT_RAW_M  (SDIO_SLC0_RX_DONE_INT_RAW_V << SDIO_SLC0_RX_DONE_INT_RAW_S)
#define SDIO_SLC0_RX_DONE_INT_RAW_V  0x00000001U
#define SDIO_SLC0_RX_DONE_INT_RAW_S  16
/** SDIO_SLC0_RX_EOF_INT_RAW : R/WTC/SS; bitpos: [17]; default: 0;
 *  The raw interrupt bit of dma channel0 finishing sending data
 */
#define SDIO_SLC0_RX_EOF_INT_RAW    (BIT(17))
#define SDIO_SLC0_RX_EOF_INT_RAW_M  (SDIO_SLC0_RX_EOF_INT_RAW_V << SDIO_SLC0_RX_EOF_INT_RAW_S)
#define SDIO_SLC0_RX_EOF_INT_RAW_V  0x00000001U
#define SDIO_SLC0_RX_EOF_INT_RAW_S  17
/** SDIO_SLC0_TOHOST_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 *  The raw interrupt bit for slave generating interrupt to host.
 */
#define SDIO_SLC0_TOHOST_INT_RAW    (BIT(18))
#define SDIO_SLC0_TOHOST_INT_RAW_M  (SDIO_SLC0_TOHOST_INT_RAW_V << SDIO_SLC0_TOHOST_INT_RAW_S)
#define SDIO_SLC0_TOHOST_INT_RAW_V  0x00000001U
#define SDIO_SLC0_TOHOST_INT_RAW_S  18
/** SDIO_SLC0_TX_DSCR_ERR_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 *  The raw interrupt bit of dma channel0 receiving descriptor error.
 */
#define SDIO_SLC0_TX_DSCR_ERR_INT_RAW    (BIT(19))
#define SDIO_SLC0_TX_DSCR_ERR_INT_RAW_M  (SDIO_SLC0_TX_DSCR_ERR_INT_RAW_V << SDIO_SLC0_TX_DSCR_ERR_INT_RAW_S)
#define SDIO_SLC0_TX_DSCR_ERR_INT_RAW_V  0x00000001U
#define SDIO_SLC0_TX_DSCR_ERR_INT_RAW_S  19
/** SDIO_SLC0_RX_DSCR_ERR_INT_RAW : R/WTC/SS; bitpos: [20]; default: 0;
 *  The raw interrupt bit of dma channel0 sending descriptor error.
 */
#define SDIO_SLC0_RX_DSCR_ERR_INT_RAW    (BIT(20))
#define SDIO_SLC0_RX_DSCR_ERR_INT_RAW_M  (SDIO_SLC0_RX_DSCR_ERR_INT_RAW_V << SDIO_SLC0_RX_DSCR_ERR_INT_RAW_S)
#define SDIO_SLC0_RX_DSCR_ERR_INT_RAW_V  0x00000001U
#define SDIO_SLC0_RX_DSCR_ERR_INT_RAW_S  20
/** SDIO_SLC0_TX_DSCR_EMPTY_INT_RAW : R/WTC/SS; bitpos: [21]; default: 0;
 *  The raw interrupt bit of  not enough buffer for slave receiving data from host
 *  through dma channel0.
 */
#define SDIO_SLC0_TX_DSCR_EMPTY_INT_RAW    (BIT(21))
#define SDIO_SLC0_TX_DSCR_EMPTY_INT_RAW_M  (SDIO_SLC0_TX_DSCR_EMPTY_INT_RAW_V << SDIO_SLC0_TX_DSCR_EMPTY_INT_RAW_S)
#define SDIO_SLC0_TX_DSCR_EMPTY_INT_RAW_V  0x00000001U
#define SDIO_SLC0_TX_DSCR_EMPTY_INT_RAW_S  21
/** SDIO_SLC0_HOST_RD_ACK_INT_RAW : R/WTC/SS; bitpos: [22]; default: 0;
 *  The raw interrupt bit for host to acknowledge retrying receiving data from slave
 *  successfully through dma channel0.
 */
#define SDIO_SLC0_HOST_RD_ACK_INT_RAW    (BIT(22))
#define SDIO_SLC0_HOST_RD_ACK_INT_RAW_M  (SDIO_SLC0_HOST_RD_ACK_INT_RAW_V << SDIO_SLC0_HOST_RD_ACK_INT_RAW_S)
#define SDIO_SLC0_HOST_RD_ACK_INT_RAW_V  0x00000001U
#define SDIO_SLC0_HOST_RD_ACK_INT_RAW_S  22
/** SDIO_SLC0_WR_RETRY_DONE_INT_RAW : R/WTC/SS; bitpos: [23]; default: 0;
 *  The raw interrupt bit of host finishing retrying sending data to slave through dma
 *  channel0.
 */
#define SDIO_SLC0_WR_RETRY_DONE_INT_RAW    (BIT(23))
#define SDIO_SLC0_WR_RETRY_DONE_INT_RAW_M  (SDIO_SLC0_WR_RETRY_DONE_INT_RAW_V << SDIO_SLC0_WR_RETRY_DONE_INT_RAW_S)
#define SDIO_SLC0_WR_RETRY_DONE_INT_RAW_V  0x00000001U
#define SDIO_SLC0_WR_RETRY_DONE_INT_RAW_S  23
/** SDIO_SLC0_TX_ERR_EOF_INT_RAW : R/WTC/SS; bitpos: [24]; default: 0;
 *  The raw interrupt bit of data error during host sending data to slave through dma
 *  channel0.
 */
#define SDIO_SLC0_TX_ERR_EOF_INT_RAW    (BIT(24))
#define SDIO_SLC0_TX_ERR_EOF_INT_RAW_M  (SDIO_SLC0_TX_ERR_EOF_INT_RAW_V << SDIO_SLC0_TX_ERR_EOF_INT_RAW_S)
#define SDIO_SLC0_TX_ERR_EOF_INT_RAW_V  0x00000001U
#define SDIO_SLC0_TX_ERR_EOF_INT_RAW_S  24
/** SDIO_CMD_DTC_INT_RAW : R/WTC/SS; bitpos: [25]; default: 0;
 *  The raw interrupt bit for sdio slave to detect command from host.
 */
#define SDIO_CMD_DTC_INT_RAW    (BIT(25))
#define SDIO_CMD_DTC_INT_RAW_M  (SDIO_CMD_DTC_INT_RAW_V << SDIO_CMD_DTC_INT_RAW_S)
#define SDIO_CMD_DTC_INT_RAW_V  0x00000001U
#define SDIO_CMD_DTC_INT_RAW_S  25
/** SDIO_SLC0_RX_QUICK_EOF_INT_RAW : R/WTC/SS; bitpos: [26]; default: 0;
 *  The raw interrupt for the linked list used reaches the number of
 *  slc0_rx_dscr_rec_lim when in stitch mode, or for every sending data transfer done.
 */
#define SDIO_SLC0_RX_QUICK_EOF_INT_RAW    (BIT(26))
#define SDIO_SLC0_RX_QUICK_EOF_INT_RAW_M  (SDIO_SLC0_RX_QUICK_EOF_INT_RAW_V << SDIO_SLC0_RX_QUICK_EOF_INT_RAW_S)
#define SDIO_SLC0_RX_QUICK_EOF_INT_RAW_V  0x00000001U
#define SDIO_SLC0_RX_QUICK_EOF_INT_RAW_S  26
/** SDIO_SLC0_HOST_POP_EOF_ERR_INT_RAW : R/WTC/SS; bitpos: [27]; default: 0;
 *  The raw interrupt bit for the eof bit error of slave receiving data through dma
 *  channel0.
 */
#define SDIO_SLC0_HOST_POP_EOF_ERR_INT_RAW    (BIT(27))
#define SDIO_SLC0_HOST_POP_EOF_ERR_INT_RAW_M  (SDIO_SLC0_HOST_POP_EOF_ERR_INT_RAW_V << SDIO_SLC0_HOST_POP_EOF_ERR_INT_RAW_S)
#define SDIO_SLC0_HOST_POP_EOF_ERR_INT_RAW_V  0x00000001U
#define SDIO_SLC0_HOST_POP_EOF_ERR_INT_RAW_S  27
/** SDIO_HDA_RECV_DONE_INT_RAW : R/WTC/SS; bitpos: [28]; default: 0;
 *  The raw interrupt bit for slave finishes receiving one cmd53 function's all block
 *  data.
 */
#define SDIO_HDA_RECV_DONE_INT_RAW    (BIT(28))
#define SDIO_HDA_RECV_DONE_INT_RAW_M  (SDIO_HDA_RECV_DONE_INT_RAW_V << SDIO_HDA_RECV_DONE_INT_RAW_S)
#define SDIO_HDA_RECV_DONE_INT_RAW_V  0x00000001U
#define SDIO_HDA_RECV_DONE_INT_RAW_S  28

/** SDIO_SLC_SLC0INT_ST_REG register
 *  Sdio slave DMA channel0 masked interrupt status register.
 */
#define SDIO_SLC_SLC0INT_ST_REG (DR_REG_SLC_BASE + 0x8)
/** SDIO_SLC_FRHOST_BIT0_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT0_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT0_INT_ST    (BIT(0))
#define SDIO_SLC_FRHOST_BIT0_INT_ST_M  (SDIO_SLC_FRHOST_BIT0_INT_ST_V << SDIO_SLC_FRHOST_BIT0_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT0_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT0_INT_ST_S  0
/** SDIO_SLC_FRHOST_BIT1_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT1_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT1_INT_ST    (BIT(1))
#define SDIO_SLC_FRHOST_BIT1_INT_ST_M  (SDIO_SLC_FRHOST_BIT1_INT_ST_V << SDIO_SLC_FRHOST_BIT1_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT1_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT1_INT_ST_S  1
/** SDIO_SLC_FRHOST_BIT2_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT2_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT2_INT_ST    (BIT(2))
#define SDIO_SLC_FRHOST_BIT2_INT_ST_M  (SDIO_SLC_FRHOST_BIT2_INT_ST_V << SDIO_SLC_FRHOST_BIT2_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT2_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT2_INT_ST_S  2
/** SDIO_SLC_FRHOST_BIT3_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT3_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT3_INT_ST    (BIT(3))
#define SDIO_SLC_FRHOST_BIT3_INT_ST_M  (SDIO_SLC_FRHOST_BIT3_INT_ST_V << SDIO_SLC_FRHOST_BIT3_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT3_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT3_INT_ST_S  3
/** SDIO_SLC_FRHOST_BIT4_INT_ST : RO; bitpos: [4]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT4_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT4_INT_ST    (BIT(4))
#define SDIO_SLC_FRHOST_BIT4_INT_ST_M  (SDIO_SLC_FRHOST_BIT4_INT_ST_V << SDIO_SLC_FRHOST_BIT4_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT4_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT4_INT_ST_S  4
/** SDIO_SLC_FRHOST_BIT5_INT_ST : RO; bitpos: [5]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT5_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT5_INT_ST    (BIT(5))
#define SDIO_SLC_FRHOST_BIT5_INT_ST_M  (SDIO_SLC_FRHOST_BIT5_INT_ST_V << SDIO_SLC_FRHOST_BIT5_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT5_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT5_INT_ST_S  5
/** SDIO_SLC_FRHOST_BIT6_INT_ST : RO; bitpos: [6]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT6_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT6_INT_ST    (BIT(6))
#define SDIO_SLC_FRHOST_BIT6_INT_ST_M  (SDIO_SLC_FRHOST_BIT6_INT_ST_V << SDIO_SLC_FRHOST_BIT6_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT6_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT6_INT_ST_S  6
/** SDIO_SLC_FRHOST_BIT7_INT_ST : RO; bitpos: [7]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT7_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT7_INT_ST    (BIT(7))
#define SDIO_SLC_FRHOST_BIT7_INT_ST_M  (SDIO_SLC_FRHOST_BIT7_INT_ST_V << SDIO_SLC_FRHOST_BIT7_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT7_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT7_INT_ST_S  7
/** SDIO_SLC0_RX_START_INT_ST : RO; bitpos: [8]; default: 0;
 *  The masked interrupt status bit for SLC0_RX_START_INT_ST interrupt.
 */
#define SDIO_SLC0_RX_START_INT_ST    (BIT(8))
#define SDIO_SLC0_RX_START_INT_ST_M  (SDIO_SLC0_RX_START_INT_ST_V << SDIO_SLC0_RX_START_INT_ST_S)
#define SDIO_SLC0_RX_START_INT_ST_V  0x00000001U
#define SDIO_SLC0_RX_START_INT_ST_S  8
/** SDIO_SLC0_TX_START_INT_ST : RO; bitpos: [9]; default: 0;
 *  The masked interrupt status bit for SLC0_TX_START_INT_ST interrupt.
 */
#define SDIO_SLC0_TX_START_INT_ST    (BIT(9))
#define SDIO_SLC0_TX_START_INT_ST_M  (SDIO_SLC0_TX_START_INT_ST_V << SDIO_SLC0_TX_START_INT_ST_S)
#define SDIO_SLC0_TX_START_INT_ST_V  0x00000001U
#define SDIO_SLC0_TX_START_INT_ST_S  9
/** SDIO_SLC0_RX_UDF_INT_ST : RO; bitpos: [10]; default: 0;
 *  The masked interrupt status bit for SLC0_RX_UDF_INT interrupt.
 */
#define SDIO_SLC0_RX_UDF_INT_ST    (BIT(10))
#define SDIO_SLC0_RX_UDF_INT_ST_M  (SDIO_SLC0_RX_UDF_INT_ST_V << SDIO_SLC0_RX_UDF_INT_ST_S)
#define SDIO_SLC0_RX_UDF_INT_ST_V  0x00000001U
#define SDIO_SLC0_RX_UDF_INT_ST_S  10
/** SDIO_SLC0_TX_OVF_INT_ST : RO; bitpos: [11]; default: 0;
 *  The masked interrupt status bit for SLC0_TX_OVF_INT interrupt.
 */
#define SDIO_SLC0_TX_OVF_INT_ST    (BIT(11))
#define SDIO_SLC0_TX_OVF_INT_ST_M  (SDIO_SLC0_TX_OVF_INT_ST_V << SDIO_SLC0_TX_OVF_INT_ST_S)
#define SDIO_SLC0_TX_OVF_INT_ST_V  0x00000001U
#define SDIO_SLC0_TX_OVF_INT_ST_S  11
/** SDIO_SLC0_TOKEN0_1TO0_INT_ST : RO; bitpos: [12]; default: 0;
 *  The masked interrupt status bit for SLC0_TOKEN0_1TO0_INT interrupt.
 */
#define SDIO_SLC0_TOKEN0_1TO0_INT_ST    (BIT(12))
#define SDIO_SLC0_TOKEN0_1TO0_INT_ST_M  (SDIO_SLC0_TOKEN0_1TO0_INT_ST_V << SDIO_SLC0_TOKEN0_1TO0_INT_ST_S)
#define SDIO_SLC0_TOKEN0_1TO0_INT_ST_V  0x00000001U
#define SDIO_SLC0_TOKEN0_1TO0_INT_ST_S  12
/** SDIO_SLC0_TOKEN1_1TO0_INT_ST : RO; bitpos: [13]; default: 0;
 *  The masked interrupt status bit for SLC0_TOKEN1_1TO0_INT interrupt.
 */
#define SDIO_SLC0_TOKEN1_1TO0_INT_ST    (BIT(13))
#define SDIO_SLC0_TOKEN1_1TO0_INT_ST_M  (SDIO_SLC0_TOKEN1_1TO0_INT_ST_V << SDIO_SLC0_TOKEN1_1TO0_INT_ST_S)
#define SDIO_SLC0_TOKEN1_1TO0_INT_ST_V  0x00000001U
#define SDIO_SLC0_TOKEN1_1TO0_INT_ST_S  13
/** SDIO_SLC0_TX_DONE_INT_ST : RO; bitpos: [14]; default: 0;
 *  The masked interrupt status bit for SLC0_TX_DONE_INT_ST interrupt.
 */
#define SDIO_SLC0_TX_DONE_INT_ST    (BIT(14))
#define SDIO_SLC0_TX_DONE_INT_ST_M  (SDIO_SLC0_TX_DONE_INT_ST_V << SDIO_SLC0_TX_DONE_INT_ST_S)
#define SDIO_SLC0_TX_DONE_INT_ST_V  0x00000001U
#define SDIO_SLC0_TX_DONE_INT_ST_S  14
/** SDIO_SLC0_TX_SUC_EOF_INT_ST : RO; bitpos: [15]; default: 0;
 *  The masked interrupt status bit for SLC0_TX_SUC_EOF_INT interrupt.
 */
#define SDIO_SLC0_TX_SUC_EOF_INT_ST    (BIT(15))
#define SDIO_SLC0_TX_SUC_EOF_INT_ST_M  (SDIO_SLC0_TX_SUC_EOF_INT_ST_V << SDIO_SLC0_TX_SUC_EOF_INT_ST_S)
#define SDIO_SLC0_TX_SUC_EOF_INT_ST_V  0x00000001U
#define SDIO_SLC0_TX_SUC_EOF_INT_ST_S  15
/** SDIO_SLC0_RX_DONE_INT_ST : RO; bitpos: [16]; default: 0;
 *  The masked interrupt status bit for SLC0_RX_DONE_INT interrupt.
 */
#define SDIO_SLC0_RX_DONE_INT_ST    (BIT(16))
#define SDIO_SLC0_RX_DONE_INT_ST_M  (SDIO_SLC0_RX_DONE_INT_ST_V << SDIO_SLC0_RX_DONE_INT_ST_S)
#define SDIO_SLC0_RX_DONE_INT_ST_V  0x00000001U
#define SDIO_SLC0_RX_DONE_INT_ST_S  16
/** SDIO_SLC0_RX_EOF_INT_ST : RO; bitpos: [17]; default: 0;
 *  The masked interrupt status bit for SLC0_RX_EOF_INT interrupt.
 */
#define SDIO_SLC0_RX_EOF_INT_ST    (BIT(17))
#define SDIO_SLC0_RX_EOF_INT_ST_M  (SDIO_SLC0_RX_EOF_INT_ST_V << SDIO_SLC0_RX_EOF_INT_ST_S)
#define SDIO_SLC0_RX_EOF_INT_ST_V  0x00000001U
#define SDIO_SLC0_RX_EOF_INT_ST_S  17
/** SDIO_SLC0_TOHOST_INT_ST : RO; bitpos: [18]; default: 0;
 *  The masked interrupt status bit for SLC0_TOHOST_INT interrupt.
 */
#define SDIO_SLC0_TOHOST_INT_ST    (BIT(18))
#define SDIO_SLC0_TOHOST_INT_ST_M  (SDIO_SLC0_TOHOST_INT_ST_V << SDIO_SLC0_TOHOST_INT_ST_S)
#define SDIO_SLC0_TOHOST_INT_ST_V  0x00000001U
#define SDIO_SLC0_TOHOST_INT_ST_S  18
/** SDIO_SLC0_TX_DSCR_ERR_INT_ST : RO; bitpos: [19]; default: 0;
 *  The masked interrupt status bit for SLC0_TX_DSCR_ERR_INT interrupt.
 */
#define SDIO_SLC0_TX_DSCR_ERR_INT_ST    (BIT(19))
#define SDIO_SLC0_TX_DSCR_ERR_INT_ST_M  (SDIO_SLC0_TX_DSCR_ERR_INT_ST_V << SDIO_SLC0_TX_DSCR_ERR_INT_ST_S)
#define SDIO_SLC0_TX_DSCR_ERR_INT_ST_V  0x00000001U
#define SDIO_SLC0_TX_DSCR_ERR_INT_ST_S  19
/** SDIO_SLC0_RX_DSCR_ERR_INT_ST : RO; bitpos: [20]; default: 0;
 *  The masked interrupt status bit for SLC0_RX_DSCR_ERR_INT interrupt.
 */
#define SDIO_SLC0_RX_DSCR_ERR_INT_ST    (BIT(20))
#define SDIO_SLC0_RX_DSCR_ERR_INT_ST_M  (SDIO_SLC0_RX_DSCR_ERR_INT_ST_V << SDIO_SLC0_RX_DSCR_ERR_INT_ST_S)
#define SDIO_SLC0_RX_DSCR_ERR_INT_ST_V  0x00000001U
#define SDIO_SLC0_RX_DSCR_ERR_INT_ST_S  20
/** SDIO_SLC0_TX_DSCR_EMPTY_INT_ST : RO; bitpos: [21]; default: 0;
 *  The masked interrupt status bit for SLC0_TX_DSCR_EMPTY_INT interrupt.
 */
#define SDIO_SLC0_TX_DSCR_EMPTY_INT_ST    (BIT(21))
#define SDIO_SLC0_TX_DSCR_EMPTY_INT_ST_M  (SDIO_SLC0_TX_DSCR_EMPTY_INT_ST_V << SDIO_SLC0_TX_DSCR_EMPTY_INT_ST_S)
#define SDIO_SLC0_TX_DSCR_EMPTY_INT_ST_V  0x00000001U
#define SDIO_SLC0_TX_DSCR_EMPTY_INT_ST_S  21
/** SDIO_SLC0_HOST_RD_ACK_INT_ST : RO; bitpos: [22]; default: 0;
 *  The masked interrupt status bit for SLC0_HOST_RD_ACK_INT interrupt.
 */
#define SDIO_SLC0_HOST_RD_ACK_INT_ST    (BIT(22))
#define SDIO_SLC0_HOST_RD_ACK_INT_ST_M  (SDIO_SLC0_HOST_RD_ACK_INT_ST_V << SDIO_SLC0_HOST_RD_ACK_INT_ST_S)
#define SDIO_SLC0_HOST_RD_ACK_INT_ST_V  0x00000001U
#define SDIO_SLC0_HOST_RD_ACK_INT_ST_S  22
/** SDIO_SLC0_WR_RETRY_DONE_INT_ST : RO; bitpos: [23]; default: 0;
 *  The masked interrupt status bit for SLC0_WR_RETRY_DONE_INT interrupt.
 */
#define SDIO_SLC0_WR_RETRY_DONE_INT_ST    (BIT(23))
#define SDIO_SLC0_WR_RETRY_DONE_INT_ST_M  (SDIO_SLC0_WR_RETRY_DONE_INT_ST_V << SDIO_SLC0_WR_RETRY_DONE_INT_ST_S)
#define SDIO_SLC0_WR_RETRY_DONE_INT_ST_V  0x00000001U
#define SDIO_SLC0_WR_RETRY_DONE_INT_ST_S  23
/** SDIO_SLC0_TX_ERR_EOF_INT_ST : RO; bitpos: [24]; default: 0;
 *  The masked interrupt status bit for SLC0_TX_ERR_EOF_INT interrupt.
 */
#define SDIO_SLC0_TX_ERR_EOF_INT_ST    (BIT(24))
#define SDIO_SLC0_TX_ERR_EOF_INT_ST_M  (SDIO_SLC0_TX_ERR_EOF_INT_ST_V << SDIO_SLC0_TX_ERR_EOF_INT_ST_S)
#define SDIO_SLC0_TX_ERR_EOF_INT_ST_V  0x00000001U
#define SDIO_SLC0_TX_ERR_EOF_INT_ST_S  24
/** SDIO_CMD_DTC_INT_ST : RO; bitpos: [25]; default: 0;
 *  The masked interrupt status bit for CMD_DTC_INT interrupt.
 */
#define SDIO_CMD_DTC_INT_ST    (BIT(25))
#define SDIO_CMD_DTC_INT_ST_M  (SDIO_CMD_DTC_INT_ST_V << SDIO_CMD_DTC_INT_ST_S)
#define SDIO_CMD_DTC_INT_ST_V  0x00000001U
#define SDIO_CMD_DTC_INT_ST_S  25
/** SDIO_SLC0_RX_QUICK_EOF_INT_ST : RO; bitpos: [26]; default: 0;
 *  The masked interrupt status bit for SLC0_RX_QUICK_EOF_INT interrupt.
 */
#define SDIO_SLC0_RX_QUICK_EOF_INT_ST    (BIT(26))
#define SDIO_SLC0_RX_QUICK_EOF_INT_ST_M  (SDIO_SLC0_RX_QUICK_EOF_INT_ST_V << SDIO_SLC0_RX_QUICK_EOF_INT_ST_S)
#define SDIO_SLC0_RX_QUICK_EOF_INT_ST_V  0x00000001U
#define SDIO_SLC0_RX_QUICK_EOF_INT_ST_S  26
/** SDIO_SLC0_HOST_POP_EOF_ERR_INT_ST : RO; bitpos: [27]; default: 0;
 *  The masked interrupt status bit for SLC0_HOST_POP_EOF_ERR_INT interrupt.
 */
#define SDIO_SLC0_HOST_POP_EOF_ERR_INT_ST    (BIT(27))
#define SDIO_SLC0_HOST_POP_EOF_ERR_INT_ST_M  (SDIO_SLC0_HOST_POP_EOF_ERR_INT_ST_V << SDIO_SLC0_HOST_POP_EOF_ERR_INT_ST_S)
#define SDIO_SLC0_HOST_POP_EOF_ERR_INT_ST_V  0x00000001U
#define SDIO_SLC0_HOST_POP_EOF_ERR_INT_ST_S  27
/** SDIO_HDA_RECV_DONE_INT_ST : RO; bitpos: [28]; default: 0;
 *  The masked interrupt status bit for HDA_RECV_DONE_INT interrupt.
 */
#define SDIO_HDA_RECV_DONE_INT_ST    (BIT(28))
#define SDIO_HDA_RECV_DONE_INT_ST_M  (SDIO_HDA_RECV_DONE_INT_ST_V << SDIO_HDA_RECV_DONE_INT_ST_S)
#define SDIO_HDA_RECV_DONE_INT_ST_V  0x00000001U
#define SDIO_HDA_RECV_DONE_INT_ST_S  28

