espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_reg.h
/** SDIO_SLC_SLC1INT_RAW_REG register
 *  Sdio slave DMA channel1 raw interrupt status register.
 */
#define SDIO_SLC_SLC1INT_RAW_REG (DR_REG_SLC_BASE + 0x14)
/** SDIO_SLC_FRHOST_BIT8_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 *  The raw interrupt bit 8 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT8_INT_RAW    (BIT(0))
#define SDIO_SLC_FRHOST_BIT8_INT_RAW_M  (SDIO_SLC_FRHOST_BIT8_INT_RAW_V << SDIO_SLC_FRHOST_BIT8_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT8_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT8_INT_RAW_S  0
/** SDIO_SLC_FRHOST_BIT9_INT_RAW : R/WTC/SS; bitpos: [1]; default: 0;
 *  The raw interrupt bit 9 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT9_INT_RAW    (BIT(1))
#define SDIO_SLC_FRHOST_BIT9_INT_RAW_M  (SDIO_SLC_FRHOST_BIT9_INT_RAW_V << SDIO_SLC_FRHOST_BIT9_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT9_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT9_INT_RAW_S  1
/** SDIO_SLC_FRHOST_BIT10_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 *  The raw interrupt bit 10 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT10_INT_RAW    (BIT(2))
#define SDIO_SLC_FRHOST_BIT10_INT_RAW_M  (SDIO_SLC_FRHOST_BIT10_INT_RAW_V << SDIO_SLC_FRHOST_BIT10_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT10_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT10_INT_RAW_S  2
/** SDIO_SLC_FRHOST_BIT11_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 *  The raw interrupt bit 11 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT11_INT_RAW    (BIT(3))
#define SDIO_SLC_FRHOST_BIT11_INT_RAW_M  (SDIO_SLC_FRHOST_BIT11_INT_RAW_V << SDIO_SLC_FRHOST_BIT11_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT11_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT11_INT_RAW_S  3
/** SDIO_SLC_FRHOST_BIT12_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 *  The raw interrupt bit 12 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT12_INT_RAW    (BIT(4))
#define SDIO_SLC_FRHOST_BIT12_INT_RAW_M  (SDIO_SLC_FRHOST_BIT12_INT_RAW_V << SDIO_SLC_FRHOST_BIT12_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT12_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT12_INT_RAW_S  4
/** SDIO_SLC_FRHOST_BIT13_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 *  The raw interrupt bit 13 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT13_INT_RAW    (BIT(5))
#define SDIO_SLC_FRHOST_BIT13_INT_RAW_M  (SDIO_SLC_FRHOST_BIT13_INT_RAW_V << SDIO_SLC_FRHOST_BIT13_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT13_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT13_INT_RAW_S  5
/** SDIO_SLC_FRHOST_BIT14_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 *  The raw interrupt bit 14 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT14_INT_RAW    (BIT(6))
#define SDIO_SLC_FRHOST_BIT14_INT_RAW_M  (SDIO_SLC_FRHOST_BIT14_INT_RAW_V << SDIO_SLC_FRHOST_BIT14_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT14_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT14_INT_RAW_S  6
/** SDIO_SLC_FRHOST_BIT15_INT_RAW : R/WTC/SS; bitpos: [7]; default: 0;
 *  The raw interrupt bit 15 for host to interrupt slave.
 */
#define SDIO_SLC_FRHOST_BIT15_INT_RAW    (BIT(7))
#define SDIO_SLC_FRHOST_BIT15_INT_RAW_M  (SDIO_SLC_FRHOST_BIT15_INT_RAW_V << SDIO_SLC_FRHOST_BIT15_INT_RAW_S)
#define SDIO_SLC_FRHOST_BIT15_INT_RAW_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT15_INT_RAW_S  7
/** SDIO_SLC1_RX_START_INT_RAW : R/WTC/SS; bitpos: [8]; default: 0;
 *  The raw interrupt bit of registering dma channel1 sending initialization
 */
#define SDIO_SLC1_RX_START_INT_RAW    (BIT(8))
#define SDIO_SLC1_RX_START_INT_RAW_M  (SDIO_SLC1_RX_START_INT_RAW_V << SDIO_SLC1_RX_START_INT_RAW_S)
#define SDIO_SLC1_RX_START_INT_RAW_V  0x00000001U
#define SDIO_SLC1_RX_START_INT_RAW_S  8
/** SDIO_SLC1_TX_START_INT_RAW : R/WTC/SS; bitpos: [9]; default: 0;
 *  The raw interrupt bit of registering dma channel1 receiving initialization
 */
#define SDIO_SLC1_TX_START_INT_RAW    (BIT(9))
#define SDIO_SLC1_TX_START_INT_RAW_M  (SDIO_SLC1_TX_START_INT_RAW_V << SDIO_SLC1_TX_START_INT_RAW_S)
#define SDIO_SLC1_TX_START_INT_RAW_V  0x00000001U
#define SDIO_SLC1_TX_START_INT_RAW_S  9
/** SDIO_SLC1_RX_UDF_INT_RAW : R/WTC/SS; bitpos: [10]; default: 0;
 *  The raw interrupt bit of dma channel1 sending buffer underflow.
 */
#define SDIO_SLC1_RX_UDF_INT_RAW    (BIT(10))
#define SDIO_SLC1_RX_UDF_INT_RAW_M  (SDIO_SLC1_RX_UDF_INT_RAW_V << SDIO_SLC1_RX_UDF_INT_RAW_S)
#define SDIO_SLC1_RX_UDF_INT_RAW_V  0x00000001U
#define SDIO_SLC1_RX_UDF_INT_RAW_S  10
/** SDIO_SLC1_TX_OVF_INT_RAW : R/WTC/SS; bitpos: [11]; default: 0;
 *  The raw interrupt bit of dma channel1 receiving buffer overflow.
 */
#define SDIO_SLC1_TX_OVF_INT_RAW    (BIT(11))
#define SDIO_SLC1_TX_OVF_INT_RAW_M  (SDIO_SLC1_TX_OVF_INT_RAW_V << SDIO_SLC1_TX_OVF_INT_RAW_S)
#define SDIO_SLC1_TX_OVF_INT_RAW_V  0x00000001U
#define SDIO_SLC1_TX_OVF_INT_RAW_S  11
/** SDIO_SLC1_TOKEN0_1TO0_INT_RAW : R/WTC/SS; bitpos: [12]; default: 0;
 *  The raw interrupt bit for the value of slc0_token0 becoming to zero.
 */
#define SDIO_SLC1_TOKEN0_1TO0_INT_RAW    (BIT(12))
#define SDIO_SLC1_TOKEN0_1TO0_INT_RAW_M  (SDIO_SLC1_TOKEN0_1TO0_INT_RAW_V << SDIO_SLC1_TOKEN0_1TO0_INT_RAW_S)
#define SDIO_SLC1_TOKEN0_1TO0_INT_RAW_V  0x00000001U
#define SDIO_SLC1_TOKEN0_1TO0_INT_RAW_S  12
/** SDIO_SLC1_TOKEN1_1TO0_INT_RAW : R/WTC/SS; bitpos: [13]; default: 0;
 *  The raw interrupt bit for the value of slc0_token1 becoming to zero.
 */
#define SDIO_SLC1_TOKEN1_1TO0_INT_RAW    (BIT(13))
#define SDIO_SLC1_TOKEN1_1TO0_INT_RAW_M  (SDIO_SLC1_TOKEN1_1TO0_INT_RAW_V << SDIO_SLC1_TOKEN1_1TO0_INT_RAW_S)
#define SDIO_SLC1_TOKEN1_1TO0_INT_RAW_V  0x00000001U
#define SDIO_SLC1_TOKEN1_1TO0_INT_RAW_S  13
/** SDIO_SLC1_TX_DONE_INT_RAW : R/WTC/SS; bitpos: [14]; default: 0;
 *  The raw interrupt bit of dma channel1 finishing receiving data to one single buffer.
 */
#define SDIO_SLC1_TX_DONE_INT_RAW    (BIT(14))
#define SDIO_SLC1_TX_DONE_INT_RAW_M  (SDIO_SLC1_TX_DONE_INT_RAW_V << SDIO_SLC1_TX_DONE_INT_RAW_S)
#define SDIO_SLC1_TX_DONE_INT_RAW_V  0x00000001U
#define SDIO_SLC1_TX_DONE_INT_RAW_S  14
/** SDIO_SLC1_TX_SUC_EOF_INT_RAW : R/WTC/SS; bitpos: [15]; default: 0;
 *  The raw interrupt bit of dma channel1 finishing receiving data
 */
#define SDIO_SLC1_TX_SUC_EOF_INT_RAW    (BIT(15))
#define SDIO_SLC1_TX_SUC_EOF_INT_RAW_M  (SDIO_SLC1_TX_SUC_EOF_INT_RAW_V << SDIO_SLC1_TX_SUC_EOF_INT_RAW_S)
#define SDIO_SLC1_TX_SUC_EOF_INT_RAW_V  0x00000001U
#define SDIO_SLC1_TX_SUC_EOF_INT_RAW_S  15
/** SDIO_SLC1_RX_DONE_INT_RAW : R/WTC/SS; bitpos: [16]; default: 0;
 *  The raw interrupt bit of dma channel1 finishing sending data from one single buffer
 */
#define SDIO_SLC1_RX_DONE_INT_RAW    (BIT(16))
#define SDIO_SLC1_RX_DONE_INT_RAW_M  (SDIO_SLC1_RX_DONE_INT_RAW_V << SDIO_SLC1_RX_DONE_INT_RAW_S)
#define SDIO_SLC1_RX_DONE_INT_RAW_V  0x00000001U
#define SDIO_SLC1_RX_DONE_INT_RAW_S  16
/** SDIO_SLC1_RX_EOF_INT_RAW : R/WTC/SS; bitpos: [17]; default: 0;
 *  The raw interrupt bit of dma channel1 finishing sending data
 */
#define SDIO_SLC1_RX_EOF_INT_RAW    (BIT(17))
#define SDIO_SLC1_RX_EOF_INT_RAW_M  (SDIO_SLC1_RX_EOF_INT_RAW_V << SDIO_SLC1_RX_EOF_INT_RAW_S)
#define SDIO_SLC1_RX_EOF_INT_RAW_V  0x00000001U
#define SDIO_SLC1_RX_EOF_INT_RAW_S  17
/** SDIO_SLC1_TOHOST_INT_RAW : R/WTC/SS; bitpos: [18]; default: 0;
 *  The raw interrupt bit for slave generating interrupt to host.
 */
#define SDIO_SLC1_TOHOST_INT_RAW    (BIT(18))
#define SDIO_SLC1_TOHOST_INT_RAW_M  (SDIO_SLC1_TOHOST_INT_RAW_V << SDIO_SLC1_TOHOST_INT_RAW_S)
#define SDIO_SLC1_TOHOST_INT_RAW_V  0x00000001U
#define SDIO_SLC1_TOHOST_INT_RAW_S  18
/** SDIO_SLC1_TX_DSCR_ERR_INT_RAW : R/WTC/SS; bitpos: [19]; default: 0;
 *  The raw interrupt bit of dma channel1 receiving descriptor error.
 */
#define SDIO_SLC1_TX_DSCR_ERR_INT_RAW    (BIT(19))
#define SDIO_SLC1_TX_DSCR_ERR_INT_RAW_M  (SDIO_SLC1_TX_DSCR_ERR_INT_RAW_V << SDIO_SLC1_TX_DSCR_ERR_INT_RAW_S)
#define SDIO_SLC1_TX_DSCR_ERR_INT_RAW_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_ERR_INT_RAW_S  19
/** SDIO_SLC1_RX_DSCR_ERR_INT_RAW : R/WTC/SS; bitpos: [20]; default: 0;
 *  The raw interrupt bit of dma channel1 sending descriptor error.
 */
#define SDIO_SLC1_RX_DSCR_ERR_INT_RAW    (BIT(20))
#define SDIO_SLC1_RX_DSCR_ERR_INT_RAW_M  (SDIO_SLC1_RX_DSCR_ERR_INT_RAW_V << SDIO_SLC1_RX_DSCR_ERR_INT_RAW_S)
#define SDIO_SLC1_RX_DSCR_ERR_INT_RAW_V  0x00000001U
#define SDIO_SLC1_RX_DSCR_ERR_INT_RAW_S  20
/** SDIO_SLC1_TX_DSCR_EMPTY_INT_RAW : R/WTC/SS; bitpos: [21]; default: 0;
 *  The raw interrupt bit of  not enough buffer for slave receiving data from host
 *  through dma channel1.
 */
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_RAW    (BIT(21))
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_RAW_M  (SDIO_SLC1_TX_DSCR_EMPTY_INT_RAW_V << SDIO_SLC1_TX_DSCR_EMPTY_INT_RAW_S)
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_RAW_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_RAW_S  21
/** SDIO_SLC1_HOST_RD_ACK_INT_RAW : R/WTC/SS; bitpos: [22]; default: 0;
 *  The raw interrupt bit for host to acknowledge retrying receiving data from slave
 *  successfully through dma channel1.
 */
#define SDIO_SLC1_HOST_RD_ACK_INT_RAW    (BIT(22))
#define SDIO_SLC1_HOST_RD_ACK_INT_RAW_M  (SDIO_SLC1_HOST_RD_ACK_INT_RAW_V << SDIO_SLC1_HOST_RD_ACK_INT_RAW_S)
#define SDIO_SLC1_HOST_RD_ACK_INT_RAW_V  0x00000001U
#define SDIO_SLC1_HOST_RD_ACK_INT_RAW_S  22
/** SDIO_SLC1_WR_RETRY_DONE_INT_RAW : R/WTC/SS; bitpos: [23]; default: 0;
 *  The raw interrupt bit of host finishing retrying sending data to slave through dma
 *  channel1.
 */
#define SDIO_SLC1_WR_RETRY_DONE_INT_RAW    (BIT(23))
#define SDIO_SLC1_WR_RETRY_DONE_INT_RAW_M  (SDIO_SLC1_WR_RETRY_DONE_INT_RAW_V << SDIO_SLC1_WR_RETRY_DONE_INT_RAW_S)
#define SDIO_SLC1_WR_RETRY_DONE_INT_RAW_V  0x00000001U
#define SDIO_SLC1_WR_RETRY_DONE_INT_RAW_S  23
/** SDIO_SLC1_TX_ERR_EOF_INT_RAW : R/WTC/SS; bitpos: [24]; default: 0;
 *  The raw interrupt bit of data error during host sending data to slave through dma
 *  channel1.
 */
#define SDIO_SLC1_TX_ERR_EOF_INT_RAW    (BIT(24))
#define SDIO_SLC1_TX_ERR_EOF_INT_RAW_M  (SDIO_SLC1_TX_ERR_EOF_INT_RAW_V << SDIO_SLC1_TX_ERR_EOF_INT_RAW_S)
#define SDIO_SLC1_TX_ERR_EOF_INT_RAW_V  0x00000001U
#define SDIO_SLC1_TX_ERR_EOF_INT_RAW_S  24

/** SDIO_SLC_SLC1INT_ST_REG register
 *  Sdio slave DMA channel1 masked interrupt status register.
 */
#define SDIO_SLC_SLC1INT_ST_REG (DR_REG_SLC_BASE + 0x18)
/** SDIO_SLC_FRHOST_BIT8_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT0_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT8_INT_ST    (BIT(0))
#define SDIO_SLC_FRHOST_BIT8_INT_ST_M  (SDIO_SLC_FRHOST_BIT8_INT_ST_V << SDIO_SLC_FRHOST_BIT8_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT8_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT8_INT_ST_S  0
/** SDIO_SLC_FRHOST_BIT9_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT1_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT9_INT_ST    (BIT(1))
#define SDIO_SLC_FRHOST_BIT9_INT_ST_M  (SDIO_SLC_FRHOST_BIT9_INT_ST_V << SDIO_SLC_FRHOST_BIT9_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT9_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT9_INT_ST_S  1
/** SDIO_SLC_FRHOST_BIT10_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT2_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT10_INT_ST    (BIT(2))
#define SDIO_SLC_FRHOST_BIT10_INT_ST_M  (SDIO_SLC_FRHOST_BIT10_INT_ST_V << SDIO_SLC_FRHOST_BIT10_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT10_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT10_INT_ST_S  2
/** SDIO_SLC_FRHOST_BIT11_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT3_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT11_INT_ST    (BIT(3))
#define SDIO_SLC_FRHOST_BIT11_INT_ST_M  (SDIO_SLC_FRHOST_BIT11_INT_ST_V << SDIO_SLC_FRHOST_BIT11_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT11_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT11_INT_ST_S  3
/** SDIO_SLC_FRHOST_BIT12_INT_ST : RO; bitpos: [4]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT4_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT12_INT_ST    (BIT(4))
#define SDIO_SLC_FRHOST_BIT12_INT_ST_M  (SDIO_SLC_FRHOST_BIT12_INT_ST_V << SDIO_SLC_FRHOST_BIT12_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT12_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT12_INT_ST_S  4
/** SDIO_SLC_FRHOST_BIT13_INT_ST : RO; bitpos: [5]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT5_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT13_INT_ST    (BIT(5))
#define SDIO_SLC_FRHOST_BIT13_INT_ST_M  (SDIO_SLC_FRHOST_BIT13_INT_ST_V << SDIO_SLC_FRHOST_BIT13_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT13_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT13_INT_ST_S  5
/** SDIO_SLC_FRHOST_BIT14_INT_ST : RO; bitpos: [6]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT6_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT14_INT_ST    (BIT(6))
#define SDIO_SLC_FRHOST_BIT14_INT_ST_M  (SDIO_SLC_FRHOST_BIT14_INT_ST_V << SDIO_SLC_FRHOST_BIT14_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT14_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT14_INT_ST_S  6
/** SDIO_SLC_FRHOST_BIT15_INT_ST : RO; bitpos: [7]; default: 0;
 *  The masked interrupt status bit for SLC_FRHOST_BIT7_INT interrupt.
 */
#define SDIO_SLC_FRHOST_BIT15_INT_ST    (BIT(7))
#define SDIO_SLC_FRHOST_BIT15_INT_ST_M  (SDIO_SLC_FRHOST_BIT15_INT_ST_V << SDIO_SLC_FRHOST_BIT15_INT_ST_S)
#define SDIO_SLC_FRHOST_BIT15_INT_ST_V  0x00000001U
#define SDIO_SLC_FRHOST_BIT15_INT_ST_S  7
/** SDIO_SLC1_RX_START_INT_ST : RO; bitpos: [8]; default: 0;
 *  The masked interrupt status bit for SLC1_RX_START_INT_ST interrupt.
 */
#define SDIO_SLC1_RX_START_INT_ST    (BIT(8))
#define SDIO_SLC1_RX_START_INT_ST_M  (SDIO_SLC1_RX_START_INT_ST_V << SDIO_SLC1_RX_START_INT_ST_S)
#define SDIO_SLC1_RX_START_INT_ST_V  0x00000001U
#define SDIO_SLC1_RX_START_INT_ST_S  8
/** SDIO_SLC1_TX_START_INT_ST : RO; bitpos: [9]; default: 0;
 *  The masked interrupt status bit for SLC1_TX_START_INT_ST interrupt.
 */
#define SDIO_SLC1_TX_START_INT_ST    (BIT(9))
#define SDIO_SLC1_TX_START_INT_ST_M  (SDIO_SLC1_TX_START_INT_ST_V << SDIO_SLC1_TX_START_INT_ST_S)
#define SDIO_SLC1_TX_START_INT_ST_V  0x00000001U
#define SDIO_SLC1_TX_START_INT_ST_S  9
/** SDIO_SLC1_RX_UDF_INT_ST : RO; bitpos: [10]; default: 0;
 *  The masked interrupt status bit for SLC1_RX_UDF_INT interrupt.
 */
#define SDIO_SLC1_RX_UDF_INT_ST    (BIT(10))
#define SDIO_SLC1_RX_UDF_INT_ST_M  (SDIO_SLC1_RX_UDF_INT_ST_V << SDIO_SLC1_RX_UDF_INT_ST_S)
#define SDIO_SLC1_RX_UDF_INT_ST_V  0x00000001U
#define SDIO_SLC1_RX_UDF_INT_ST_S  10
/** SDIO_SLC1_TX_OVF_INT_ST : RO; bitpos: [11]; default: 0;
 *  The masked interrupt status bit for SLC1_TX_OVF_INT interrupt.
 */
#define SDIO_SLC1_TX_OVF_INT_ST    (BIT(11))
#define SDIO_SLC1_TX_OVF_INT_ST_M  (SDIO_SLC1_TX_OVF_INT_ST_V << SDIO_SLC1_TX_OVF_INT_ST_S)
#define SDIO_SLC1_TX_OVF_INT_ST_V  0x00000001U
#define SDIO_SLC1_TX_OVF_INT_ST_S  11
/** SDIO_SLC1_TOKEN0_1TO0_INT_ST : RO; bitpos: [12]; default: 0;
 *  The masked interrupt status bit for SLC1_TOKEN0_1TO0_INT interrupt.
 */
#define SDIO_SLC1_TOKEN0_1TO0_INT_ST    (BIT(12))
#define SDIO_SLC1_TOKEN0_1TO0_INT_ST_M  (SDIO_SLC1_TOKEN0_1TO0_INT_ST_V << SDIO_SLC1_TOKEN0_1TO0_INT_ST_S)
#define SDIO_SLC1_TOKEN0_1TO0_INT_ST_V  0x00000001U
#define SDIO_SLC1_TOKEN0_1TO0_INT_ST_S  12
/** SDIO_SLC1_TOKEN1_1TO0_INT_ST : RO; bitpos: [13]; default: 0;
 *  The masked interrupt status bit for SLC1_TOKEN1_1TO0_INT interrupt.
 */
#define SDIO_SLC1_TOKEN1_1TO0_INT_ST    (BIT(13))
#define SDIO_SLC1_TOKEN1_1TO0_INT_ST_M  (SDIO_SLC1_TOKEN1_1TO0_INT_ST_V << SDIO_SLC1_TOKEN1_1TO0_INT_ST_S)
#define SDIO_SLC1_TOKEN1_1TO0_INT_ST_V  0x00000001U
#define SDIO_SLC1_TOKEN1_1TO0_INT_ST_S  13
/** SDIO_SLC1_TX_DONE_INT_ST : RO; bitpos: [14]; default: 0;
 *  The masked interrupt status bit for SLC1_TX_DONE_INT_ST interrupt.
 */
#define SDIO_SLC1_TX_DONE_INT_ST    (BIT(14))
#define SDIO_SLC1_TX_DONE_INT_ST_M  (SDIO_SLC1_TX_DONE_INT_ST_V << SDIO_SLC1_TX_DONE_INT_ST_S)
#define SDIO_SLC1_TX_DONE_INT_ST_V  0x00000001U
#define SDIO_SLC1_TX_DONE_INT_ST_S  14
/** SDIO_SLC1_TX_SUC_EOF_INT_ST : RO; bitpos: [15]; default: 0;
 *  The masked interrupt status bit for SLC1_TX_SUC_EOF_INT interrupt.
 */
#define SDIO_SLC1_TX_SUC_EOF_INT_ST    (BIT(15))
#define SDIO_SLC1_TX_SUC_EOF_INT_ST_M  (SDIO_SLC1_TX_SUC_EOF_INT_ST_V << SDIO_SLC1_TX_SUC_EOF_INT_ST_S)
#define SDIO_SLC1_TX_SUC_EOF_INT_ST_V  0x00000001U
#define SDIO_SLC1_TX_SUC_EOF_INT_ST_S  15
/** SDIO_SLC1_RX_DONE_INT_ST : RO; bitpos: [16]; default: 0;
 *  The masked interrupt status bit for SLC1_RX_DONE_INT interrupt.
 */
#define SDIO_SLC1_RX_DONE_INT_ST    (BIT(16))
#define SDIO_SLC1_RX_DONE_INT_ST_M  (SDIO_SLC1_RX_DONE_INT_ST_V << SDIO_SLC1_RX_DONE_INT_ST_S)
#define SDIO_SLC1_RX_DONE_INT_ST_V  0x00000001U
#define SDIO_SLC1_RX_DONE_INT_ST_S  16
/** SDIO_SLC1_RX_EOF_INT_ST : RO; bitpos: [17]; default: 0;
 *  The masked interrupt status bit for SLC1_RX_EOF_INT interrupt.
 */
#define SDIO_SLC1_RX_EOF_INT_ST    (BIT(17))
#define SDIO_SLC1_RX_EOF_INT_ST_M  (SDIO_SLC1_RX_EOF_INT_ST_V << SDIO_SLC1_RX_EOF_INT_ST_S)
#define SDIO_SLC1_RX_EOF_INT_ST_V  0x00000001U
#define SDIO_SLC1_RX_EOF_INT_ST_S  17
/** SDIO_SLC1_TOHOST_INT_ST : RO; bitpos: [18]; default: 0;
 *  The masked interrupt status bit for SLC1_TOHOST_INT interrupt.
 */
#define SDIO_SLC1_TOHOST_INT_ST    (BIT(18))
#define SDIO_SLC1_TOHOST_INT_ST_M  (SDIO_SLC1_TOHOST_INT_ST_V << SDIO_SLC1_TOHOST_INT_ST_S)
#define SDIO_SLC1_TOHOST_INT_ST_V  0x00000001U
#define SDIO_SLC1_TOHOST_INT_ST_S  18
/** SDIO_SLC1_TX_DSCR_ERR_INT_ST : RO; bitpos: [19]; default: 0;
 *  The masked interrupt status bit for SLC1_TX_DSCR_ERR_INT interrupt.
 */
#define SDIO_SLC1_TX_DSCR_ERR_INT_ST    (BIT(19))
#define SDIO_SLC1_TX_DSCR_ERR_INT_ST_M  (SDIO_SLC1_TX_DSCR_ERR_INT_ST_V << SDIO_SLC1_TX_DSCR_ERR_INT_ST_S)
#define SDIO_SLC1_TX_DSCR_ERR_INT_ST_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_ERR_INT_ST_S  19
/** SDIO_SLC1_RX_DSCR_ERR_INT_ST : RO; bitpos: [20]; default: 0;
 *  The masked interrupt status bit for SLC1_RX_DSCR_ERR_INT interrupt.
 */
#define SDIO_SLC1_RX_DSCR_ERR_INT_ST    (BIT(20))
#define SDIO_SLC1_RX_DSCR_ERR_INT_ST_M  (SDIO_SLC1_RX_DSCR_ERR_INT_ST_V << SDIO_SLC1_RX_DSCR_ERR_INT_ST_S)
#define SDIO_SLC1_RX_DSCR_ERR_INT_ST_V  0x00000001U
#define SDIO_SLC1_RX_DSCR_ERR_INT_ST_S  20
/** SDIO_SLC1_TX_DSCR_EMPTY_INT_ST : RO; bitpos: [21]; default: 0;
 *  The masked interrupt status bit for SLC1_TX_DSCR_EMPTY_INT interrupt.
 */
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ST    (BIT(21))
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ST_M  (SDIO_SLC1_TX_DSCR_EMPTY_INT_ST_V << SDIO_SLC1_TX_DSCR_EMPTY_INT_ST_S)
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ST_V  0x00000001U
#define SDIO_SLC1_TX_DSCR_EMPTY_INT_ST_S  21
/** SDIO_SLC1_HOST_RD_ACK_INT_ST : RO; bitpos: [22]; default: 0;
 *  The masked interrupt status bit for SLC1_HOST_RD_ACK_INT interrupt.
 */
#define SDIO_SLC1_HOST_RD_ACK_INT_ST    (BIT(22))
#define SDIO_SLC1_HOST_RD_ACK_INT_ST_M  (SDIO_SLC1_HOST_RD_ACK_INT_ST_V << SDIO_SLC1_HOST_RD_ACK_INT_ST_S)
#define SDIO_SLC1_HOST_RD_ACK_INT_ST_V  0x00000001U
#define SDIO_SLC1_HOST_RD_ACK_INT_ST_S  22
/** SDIO_SLC1_WR_RETRY_DONE_INT_ST : RO; bitpos: [23]; default: 0;
 *  The masked interrupt status bit for SLC1_WR_RETRY_DONE_INT interrupt.
 */
#define SDIO_SLC1_WR_RETRY_DONE_INT_ST    (BIT(23))
#define SDIO_SLC1_WR_RETRY_DONE_INT_ST_M  (SDIO_SLC1_WR_RETRY_DONE_INT_ST_V << SDIO_SLC1_WR_RETRY_DONE_INT_ST_S)
#define SDIO_SLC1_WR_RETRY_DONE_INT_ST_V  0x00000001U
#define SDIO_SLC1_WR_RETRY_DONE_INT_ST_S  23
/** SDIO_SLC1_TX_ERR_EOF_INT_ST : RO; bitpos: [24]; default: 0;
 *  The masked interrupt status bit for SLC1_TX_ERR_EOF_INT interrupt.
 */
#define SDIO_SLC1_TX_ERR_EOF_INT_ST    (BIT(24))
#define SDIO_SLC1_TX_ERR_EOF_INT_ST_M  (SDIO_SLC1_TX_ERR_EOF_INT_ST_V << SDIO_SLC1_TX_ERR_EOF_INT_ST_S)
#define SDIO_SLC1_TX_ERR_EOF_INT_ST_V  0x00000001U
#define SDIO_SLC1_TX_ERR_EOF_INT_ST_S  24

