espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_reg.h
/** SDIO_SLC_TX_STATUS_REG register
 *  Sdio slave DMA txfifo status register.
 */
#define SDIO_SLC_TX_STATUS_REG (DR_REG_SLC_BASE + 0x30)
/** SDIO_SLC0_TX_FULL : RO; bitpos: [0]; default: 0;
 *  The status bit for txfifo full during slave receiving data from host through dma
 *  channel0.
 */
#define SDIO_SLC0_TX_FULL    (BIT(0))
#define SDIO_SLC0_TX_FULL_M  (SDIO_SLC0_TX_FULL_V << SDIO_SLC0_TX_FULL_S)
#define SDIO_SLC0_TX_FULL_V  0x00000001U
#define SDIO_SLC0_TX_FULL_S  0
/** SDIO_SLC0_TX_EMPTY : RO; bitpos: [1]; default: 1;
 *  The status bit for txfifo empty during slave receiving data from host through dma
 *  channel0.
 */
#define SDIO_SLC0_TX_EMPTY    (BIT(1))
#define SDIO_SLC0_TX_EMPTY_M  (SDIO_SLC0_TX_EMPTY_V << SDIO_SLC0_TX_EMPTY_S)
#define SDIO_SLC0_TX_EMPTY_V  0x00000001U
#define SDIO_SLC0_TX_EMPTY_S  1
/** SDIO_SLC1_TX_FULL : RO; bitpos: [16]; default: 0;
 *  The status bit for txfifo full during slave receiving data from host through dma
 *  channel1.
 */
#define SDIO_SLC1_TX_FULL    (BIT(16))
#define SDIO_SLC1_TX_FULL_M  (SDIO_SLC1_TX_FULL_V << SDIO_SLC1_TX_FULL_S)
#define SDIO_SLC1_TX_FULL_V  0x00000001U
#define SDIO_SLC1_TX_FULL_S  16
/** SDIO_SLC1_TX_EMPTY : RO; bitpos: [17]; default: 1;
 *  The status bit for txfifo empty during slave receiving data from host through dma
 *  channel1.
 */
#define SDIO_SLC1_TX_EMPTY    (BIT(17))
#define SDIO_SLC1_TX_EMPTY_M  (SDIO_SLC1_TX_EMPTY_V << SDIO_SLC1_TX_EMPTY_S)
#define SDIO_SLC1_TX_EMPTY_V  0x00000001U
#define SDIO_SLC1_TX_EMPTY_S  17

/** SDIO_SLC_SLC0TXFIFO_POP_REG register
 *  Sdio slave DMA channel0 txfifo debug register.
 */
#define SDIO_SLC_SLC0TXFIFO_POP_REG (DR_REG_SLC_BASE + 0x34)
/** SDIO_SLC0_TXFIFO_RDATA : RO; bitpos: [10:0]; default: 1024;
 *  This field saves the data read from txfifo through APB bus.
 */
#define SDIO_SLC0_TXFIFO_RDATA    0x000007FFU
#define SDIO_SLC0_TXFIFO_RDATA_M  (SDIO_SLC0_TXFIFO_RDATA_V << SDIO_SLC0_TXFIFO_RDATA_S)
#define SDIO_SLC0_TXFIFO_RDATA_V  0x000007FFU
#define SDIO_SLC0_TXFIFO_RDATA_S  0
/** SDIO_SLC0_TXFIFO_POP : R/W/SC; bitpos: [16]; default: 0;
 *  Set this bit to read data from txfifo through APB bus. This bit is cleared
 *  automatically after reading one data from slc0_txfifo through APB bus successfully.
 */
#define SDIO_SLC0_TXFIFO_POP    (BIT(16))
#define SDIO_SLC0_TXFIFO_POP_M  (SDIO_SLC0_TXFIFO_POP_V << SDIO_SLC0_TXFIFO_POP_S)
#define SDIO_SLC0_TXFIFO_POP_V  0x00000001U
#define SDIO_SLC0_TXFIFO_POP_S  16

/** SDIO_SLC_SLC1TXFIFO_POP_REG register
 *  Sdio slave DMA channel1 txfifo debug register.
 */
#define SDIO_SLC_SLC1TXFIFO_POP_REG (DR_REG_SLC_BASE + 0x38)
/** SDIO_SLC1_TXFIFO_RDATA : RO; bitpos: [10:0]; default: 1024;
 *  This field saves the data read from txfifo through APB bus.
 */
#define SDIO_SLC1_TXFIFO_RDATA    0x000007FFU
#define SDIO_SLC1_TXFIFO_RDATA_M  (SDIO_SLC1_TXFIFO_RDATA_V << SDIO_SLC1_TXFIFO_RDATA_S)
#define SDIO_SLC1_TXFIFO_RDATA_V  0x000007FFU
#define SDIO_SLC1_TXFIFO_RDATA_S  0
/** SDIO_SLC1_TXFIFO_POP : R/W/SC; bitpos: [16]; default: 0;
 *  Set this bit to read data from txfifo through APB bus. This bit is cleared
 *  automatically after reading one data from slc1_txfifo through APB bus successfully.
 */
#define SDIO_SLC1_TXFIFO_POP    (BIT(16))
#define SDIO_SLC1_TXFIFO_POP_M  (SDIO_SLC1_TXFIFO_POP_V << SDIO_SLC1_TXFIFO_POP_S)
#define SDIO_SLC1_TXFIFO_POP_V  0x00000001U
#define SDIO_SLC1_TXFIFO_POP_S  16

/** SDIO_SLC_SLC0RX_LINK_REG register
 *  Sdio slave DMA channel0 configuration and status register of link list for slave
 *  sending data.
 */
#define SDIO_SLC_SLC0RX_LINK_REG (DR_REG_SLC_BASE + 0x3c)
/** SDIO_SLC0_RXLINK_STOP : R/W/SC; bitpos: [28]; default: 0;
 *  Set 1 to stop the linked list operation for dma channel0 sending packets.
 */
#define SDIO_SLC0_RXLINK_STOP    (BIT(28))
#define SDIO_SLC0_RXLINK_STOP_M  (SDIO_SLC0_RXLINK_STOP_V << SDIO_SLC0_RXLINK_STOP_S)
#define SDIO_SLC0_RXLINK_STOP_V  0x00000001U
#define SDIO_SLC0_RXLINK_STOP_S  28
/** SDIO_SLC0_RXLINK_START : R/W/SC; bitpos: [29]; default: 0;
 *  Set 1 to start the linked list operation for dma channel0 sending packets. Sending
 *  will start from address indicated by SLC0_RXLINK_ADDR.
 */
#define SDIO_SLC0_RXLINK_START    (BIT(29))
#define SDIO_SLC0_RXLINK_START_M  (SDIO_SLC0_RXLINK_START_V << SDIO_SLC0_RXLINK_START_S)
#define SDIO_SLC0_RXLINK_START_V  0x00000001U
#define SDIO_SLC0_RXLINK_START_S  29
/** SDIO_SLC0_RXLINK_RESTART : R/W/SC; bitpos: [30]; default: 0;
 *  Set 1 to restart and continue the linked list operation for dma channel0 sending
 *  packets.
 */
#define SDIO_SLC0_RXLINK_RESTART    (BIT(30))
#define SDIO_SLC0_RXLINK_RESTART_M  (SDIO_SLC0_RXLINK_RESTART_V << SDIO_SLC0_RXLINK_RESTART_S)
#define SDIO_SLC0_RXLINK_RESTART_V  0x00000001U
#define SDIO_SLC0_RXLINK_RESTART_S  30
/** SDIO_SLC0_RXLINK_PARK : RO; bitpos: [31]; default: 1;
 *  The status bit for sending link list fsm of dma channel0 in idle state
 */
#define SDIO_SLC0_RXLINK_PARK    (BIT(31))
#define SDIO_SLC0_RXLINK_PARK_M  (SDIO_SLC0_RXLINK_PARK_V << SDIO_SLC0_RXLINK_PARK_S)
#define SDIO_SLC0_RXLINK_PARK_V  0x00000001U
#define SDIO_SLC0_RXLINK_PARK_S  31

/** SDIO_SLC_SLC0RX_LINK_ADDR_REG register
 *  Sdio slave DMA channel0 address of first descriptor of sending link list.
 */
#define SDIO_SLC_SLC0RX_LINK_ADDR_REG (DR_REG_SLC_BASE + 0x40)
/** SDIO_SLC0_RXLINK_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  The initial address of dma channel0's sending linked list.
 */
#define SDIO_SLC0_RXLINK_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_RXLINK_ADDR_M  (SDIO_SLC0_RXLINK_ADDR_V << SDIO_SLC0_RXLINK_ADDR_S)
#define SDIO_SLC0_RXLINK_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_RXLINK_ADDR_S  0

/** SDIO_SLC_SLC0TX_LINK_REG register
 *  Sdio slave DMA channel0 configuration and status register of link list for slave
 *  receiving data.
 */
#define SDIO_SLC_SLC0TX_LINK_REG (DR_REG_SLC_BASE + 0x44)
/** SDIO_SLC0_TXLINK_STOP : R/W/SC; bitpos: [28]; default: 0;
 *  Set 1 to stop the linked list operation for dma channel0 receiving packets.
 */
#define SDIO_SLC0_TXLINK_STOP    (BIT(28))
#define SDIO_SLC0_TXLINK_STOP_M  (SDIO_SLC0_TXLINK_STOP_V << SDIO_SLC0_TXLINK_STOP_S)
#define SDIO_SLC0_TXLINK_STOP_V  0x00000001U
#define SDIO_SLC0_TXLINK_STOP_S  28
/** SDIO_SLC0_TXLINK_START : R/W/SC; bitpos: [29]; default: 0;
 *  Set 1 to start the linked list operation for dma channel0 receiving packets.
 *  Sending will start from address indicated by SLC0_TXLINK_ADDR.
 */
#define SDIO_SLC0_TXLINK_START    (BIT(29))
#define SDIO_SLC0_TXLINK_START_M  (SDIO_SLC0_TXLINK_START_V << SDIO_SLC0_TXLINK_START_S)
#define SDIO_SLC0_TXLINK_START_V  0x00000001U
#define SDIO_SLC0_TXLINK_START_S  29
/** SDIO_SLC0_TXLINK_RESTART : R/W/SC; bitpos: [30]; default: 0;
 *  Set 1 to restart and continue the linked list operation for dma channel0 receiving
 *  packets.
 */
#define SDIO_SLC0_TXLINK_RESTART    (BIT(30))
#define SDIO_SLC0_TXLINK_RESTART_M  (SDIO_SLC0_TXLINK_RESTART_V << SDIO_SLC0_TXLINK_RESTART_S)
#define SDIO_SLC0_TXLINK_RESTART_V  0x00000001U
#define SDIO_SLC0_TXLINK_RESTART_S  30
/** SDIO_SLC0_TXLINK_PARK : RO; bitpos: [31]; default: 1;
 *  The status bit for receiving link list fsm of dma channel0 in idle state
 */
#define SDIO_SLC0_TXLINK_PARK    (BIT(31))
#define SDIO_SLC0_TXLINK_PARK_M  (SDIO_SLC0_TXLINK_PARK_V << SDIO_SLC0_TXLINK_PARK_S)
#define SDIO_SLC0_TXLINK_PARK_V  0x00000001U
#define SDIO_SLC0_TXLINK_PARK_S  31

/** SDIO_SLC_SLC0TX_LINK_ADDR_REG register
 *  Sdio slave DMA channel0 address of first descriptor of receiving linked list.
 */
#define SDIO_SLC_SLC0TX_LINK_ADDR_REG (DR_REG_SLC_BASE + 0x48)
/** SDIO_SLC0_TXLINK_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  The initial address of dma channel0's receiving linked list.
 */
#define SDIO_SLC0_TXLINK_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_TXLINK_ADDR_M  (SDIO_SLC0_TXLINK_ADDR_V << SDIO_SLC0_TXLINK_ADDR_S)
#define SDIO_SLC0_TXLINK_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_TXLINK_ADDR_S  0

