espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_reg.h
/** SDIO_SLC_SLC1TOKEN1_REG register
 *  Sdio slave DMA channel1 receiving buffer configuration and status register1.
 */
#define SDIO_SLC_SLC1TOKEN1_REG (DR_REG_SLC_BASE + 0x6c)
/** SDIO_SLC1_TOKEN1_WDATA : WT; bitpos: [11:0]; default: 0;
 *  The number of available receiving buffers.
 */
#define SDIO_SLC1_TOKEN1_WDATA    0x00000FFFU
#define SDIO_SLC1_TOKEN1_WDATA_M  (SDIO_SLC1_TOKEN1_WDATA_V << SDIO_SLC1_TOKEN1_WDATA_S)
#define SDIO_SLC1_TOKEN1_WDATA_V  0x00000FFFU
#define SDIO_SLC1_TOKEN1_WDATA_S  0
/** SDIO_SLC1_TOKEN1_WR : WT; bitpos: [12]; default: 0;
 *  update SLC1_token1_wdata into SLC1 token1
 */
#define SDIO_SLC1_TOKEN1_WR    (BIT(12))
#define SDIO_SLC1_TOKEN1_WR_M  (SDIO_SLC1_TOKEN1_WR_V << SDIO_SLC1_TOKEN1_WR_S)
#define SDIO_SLC1_TOKEN1_WR_V  0x00000001U
#define SDIO_SLC1_TOKEN1_WR_S  12
/** SDIO_SLC1_TOKEN1_INC : WT; bitpos: [13]; default: 0;
 *  SLC1_token1 becomes to 1 when auto clear SLC1_token1, else add 1 to SLC1_token1
 */
#define SDIO_SLC1_TOKEN1_INC    (BIT(13))
#define SDIO_SLC1_TOKEN1_INC_M  (SDIO_SLC1_TOKEN1_INC_V << SDIO_SLC1_TOKEN1_INC_S)
#define SDIO_SLC1_TOKEN1_INC_V  0x00000001U
#define SDIO_SLC1_TOKEN1_INC_S  13
/** SDIO_SLC1_TOKEN1_INC_MORE : WT; bitpos: [14]; default: 0;
 *  Set this bit to add the value of SDIO_SLC1TOKEN1_SLC1_TOKEN1_WDATA to
 *  SDIO_SLC1TOKEN1_SLC1_TOKEN1.
 */
#define SDIO_SLC1_TOKEN1_INC_MORE    (BIT(14))
#define SDIO_SLC1_TOKEN1_INC_MORE_M  (SDIO_SLC1_TOKEN1_INC_MORE_V << SDIO_SLC1_TOKEN1_INC_MORE_S)
#define SDIO_SLC1_TOKEN1_INC_MORE_V  0x00000001U
#define SDIO_SLC1_TOKEN1_INC_MORE_S  14
/** SDIO_SLC1_TOKEN1 : RO; bitpos: [27:16]; default: 0;
 *  The accumulated number of buffers for receiving packets through dma channel1.
 */
#define SDIO_SLC1_TOKEN1    0x00000FFFU
#define SDIO_SLC1_TOKEN1_M  (SDIO_SLC1_TOKEN1_V << SDIO_SLC1_TOKEN1_S)
#define SDIO_SLC1_TOKEN1_V  0x00000FFFU
#define SDIO_SLC1_TOKEN1_S  16

/** SDIO_SLC_CONF1_REG register
 *  Sdio slave DMA configuration1 register.
 */
#define SDIO_SLC_CONF1_REG (DR_REG_SLC_BASE + 0x70)
/** SDIO_SLC0_CHECK_OWNER : R/W; bitpos: [0]; default: 0;
 *  Set 1 to check the owner bit of descriptors  used by dma channel0.
 */
#define SDIO_SLC0_CHECK_OWNER    (BIT(0))
#define SDIO_SLC0_CHECK_OWNER_M  (SDIO_SLC0_CHECK_OWNER_V << SDIO_SLC0_CHECK_OWNER_S)
#define SDIO_SLC0_CHECK_OWNER_V  0x00000001U
#define SDIO_SLC0_CHECK_OWNER_S  0
/** SDIO_SLC0_TX_CHECK_SUM_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to enable check sum function during slave receiving packets through dma
 *  channel0.
 */
#define SDIO_SLC0_TX_CHECK_SUM_EN    (BIT(1))
#define SDIO_SLC0_TX_CHECK_SUM_EN_M  (SDIO_SLC0_TX_CHECK_SUM_EN_V << SDIO_SLC0_TX_CHECK_SUM_EN_S)
#define SDIO_SLC0_TX_CHECK_SUM_EN_V  0x00000001U
#define SDIO_SLC0_TX_CHECK_SUM_EN_S  1
/** SDIO_SLC0_RX_CHECK_SUM_EN : R/W; bitpos: [2]; default: 0;
 *  Set 1 to enable check sum function during slave sending packets through dma
 *  channel0.
 */
#define SDIO_SLC0_RX_CHECK_SUM_EN    (BIT(2))
#define SDIO_SLC0_RX_CHECK_SUM_EN_M  (SDIO_SLC0_RX_CHECK_SUM_EN_V << SDIO_SLC0_RX_CHECK_SUM_EN_S)
#define SDIO_SLC0_RX_CHECK_SUM_EN_V  0x00000001U
#define SDIO_SLC0_RX_CHECK_SUM_EN_S  2
/** SDIO_SDIO_CMD_HOLD_EN : R/W; bitpos: [3]; default: 1;
 *  Allow host to send another cmd53 during last cmd53 operating time.
 */
#define SDIO_SDIO_CMD_HOLD_EN    (BIT(3))
#define SDIO_SDIO_CMD_HOLD_EN_M  (SDIO_SDIO_CMD_HOLD_EN_V << SDIO_SDIO_CMD_HOLD_EN_S)
#define SDIO_SDIO_CMD_HOLD_EN_V  0x00000001U
#define SDIO_SDIO_CMD_HOLD_EN_S  3
/** SDIO_SLC0_LEN_AUTO_CLR : R/W; bitpos: [4]; default: 1;
 *  Set 1 to automatically clear the length of buffers used to send packets ot host
 *  after host reads this length. (not recommended to use,should be set to 0)
 */
#define SDIO_SLC0_LEN_AUTO_CLR    (BIT(4))
#define SDIO_SLC0_LEN_AUTO_CLR_M  (SDIO_SLC0_LEN_AUTO_CLR_V << SDIO_SLC0_LEN_AUTO_CLR_S)
#define SDIO_SLC0_LEN_AUTO_CLR_V  0x00000001U
#define SDIO_SLC0_LEN_AUTO_CLR_S  4
/** SDIO_SLC0_TX_STITCH_EN : R/W; bitpos: [5]; default: 1;
 *  Set 1 to enable the stitch mode of dma channel0 receiving linked list .
 */
#define SDIO_SLC0_TX_STITCH_EN    (BIT(5))
#define SDIO_SLC0_TX_STITCH_EN_M  (SDIO_SLC0_TX_STITCH_EN_V << SDIO_SLC0_TX_STITCH_EN_S)
#define SDIO_SLC0_TX_STITCH_EN_V  0x00000001U
#define SDIO_SLC0_TX_STITCH_EN_S  5
/** SDIO_SLC0_RX_STITCH_EN : R/W; bitpos: [6]; default: 1;
 *  Set 1 to enable the stitch mode of dma channel0 sending linked list .
 */
#define SDIO_SLC0_RX_STITCH_EN    (BIT(6))
#define SDIO_SLC0_RX_STITCH_EN_M  (SDIO_SLC0_RX_STITCH_EN_V << SDIO_SLC0_RX_STITCH_EN_S)
#define SDIO_SLC0_RX_STITCH_EN_V  0x00000001U
#define SDIO_SLC0_RX_STITCH_EN_S  6
/** SDIO_SLC1_CHECK_OWNER : R/W; bitpos: [16]; default: 0;
 *  Set 1 to check the owner bit of descriptors  used by dma channel1.
 */
#define SDIO_SLC1_CHECK_OWNER    (BIT(16))
#define SDIO_SLC1_CHECK_OWNER_M  (SDIO_SLC1_CHECK_OWNER_V << SDIO_SLC1_CHECK_OWNER_S)
#define SDIO_SLC1_CHECK_OWNER_V  0x00000001U
#define SDIO_SLC1_CHECK_OWNER_S  16
/** SDIO_SLC1_TX_CHECK_SUM_EN : R/W; bitpos: [17]; default: 0;
 *  Set 1 to enable check sum function during slave receiving packets through dma
 *  channel1.
 */
#define SDIO_SLC1_TX_CHECK_SUM_EN    (BIT(17))
#define SDIO_SLC1_TX_CHECK_SUM_EN_M  (SDIO_SLC1_TX_CHECK_SUM_EN_V << SDIO_SLC1_TX_CHECK_SUM_EN_S)
#define SDIO_SLC1_TX_CHECK_SUM_EN_V  0x00000001U
#define SDIO_SLC1_TX_CHECK_SUM_EN_S  17
/** SDIO_SLC1_RX_CHECK_SUM_EN : R/W; bitpos: [18]; default: 0;
 *  Set 1 to enable check sum function during slave sending packets through dma
 *  channel1.
 */
#define SDIO_SLC1_RX_CHECK_SUM_EN    (BIT(18))
#define SDIO_SLC1_RX_CHECK_SUM_EN_M  (SDIO_SLC1_RX_CHECK_SUM_EN_V << SDIO_SLC1_RX_CHECK_SUM_EN_S)
#define SDIO_SLC1_RX_CHECK_SUM_EN_V  0x00000001U
#define SDIO_SLC1_RX_CHECK_SUM_EN_S  18
/** SDIO_HOST_INT_LEVEL_SEL : R/W; bitpos: [19]; default: 0;
 *  Set the polarity of interrupt generated to host: 0-low active, 1-high active.
 */
#define SDIO_HOST_INT_LEVEL_SEL    (BIT(19))
#define SDIO_HOST_INT_LEVEL_SEL_M  (SDIO_HOST_INT_LEVEL_SEL_V << SDIO_HOST_INT_LEVEL_SEL_S)
#define SDIO_HOST_INT_LEVEL_SEL_V  0x00000001U
#define SDIO_HOST_INT_LEVEL_SEL_S  19
/** SDIO_SDIO_CLK_EN : R/W; bitpos: [22]; default: 0;
 *  Sdio slave dma registers' clock gating enable bit: 0-the sdio slave dma registers'
 *  clock is on  during apb operation, 1- the sdio slave dma registers' clock is always
 *  on.
 */
#define SDIO_SDIO_CLK_EN    (BIT(22))
#define SDIO_SDIO_CLK_EN_M  (SDIO_SDIO_CLK_EN_V << SDIO_SDIO_CLK_EN_S)
#define SDIO_SDIO_CLK_EN_V  0x00000001U
#define SDIO_SDIO_CLK_EN_S  22

/** SDIO_SLC_SLC0_STATE0_REG register
 *  Sdio slave DMA channel0 status register.
 */
#define SDIO_SLC_SLC0_STATE0_REG (DR_REG_SLC_BASE + 0x74)
/** SDIO_SLC0_STATE0 : RO; bitpos: [31:0]; default: 0;
 *  [18:0] the current receiving descriptor address, [20:19] receiving descriptor fsm
 *  state, [23:21] receiving fsm state, [30:24] the count value of data received in
 *  txfifo
 */
#define SDIO_SLC0_STATE0    0xFFFFFFFFU
#define SDIO_SLC0_STATE0_M  (SDIO_SLC0_STATE0_V << SDIO_SLC0_STATE0_S)
#define SDIO_SLC0_STATE0_V  0xFFFFFFFFU
#define SDIO_SLC0_STATE0_S  0

