espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_reg.h
/** SDIO_SLC_SLC1_TX_EOF_DES_ADDR_REG register
 *  Sdio slave DMA channel1 receiving packet status register.
 */
#define SDIO_SLC_SLC1_TX_EOF_DES_ADDR_REG (DR_REG_SLC_BASE + 0x98)
/** SDIO_SLC1_TX_SUC_EOF_DES_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The descriptor address of the last successfully received packet through dma
 *  channel1.
 */
#define SDIO_SLC1_TX_SUC_EOF_DES_ADDR    0xFFFFFFFFU
#define SDIO_SLC1_TX_SUC_EOF_DES_ADDR_M  (SDIO_SLC1_TX_SUC_EOF_DES_ADDR_V << SDIO_SLC1_TX_SUC_EOF_DES_ADDR_S)
#define SDIO_SLC1_TX_SUC_EOF_DES_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC1_TX_SUC_EOF_DES_ADDR_S  0

/** SDIO_SLC_SLC1_TO_EOF_BFR_DES_ADDR_REG register
 *  Sdio slave DMA channel1 start address of sending linked list register.
 */
#define SDIO_SLC_SLC1_TO_EOF_BFR_DES_ADDR_REG (DR_REG_SLC_BASE + 0x9c)
/** SDIO_SLC1_TO_EOF_BFR_DES_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The descriptor address of the last successfully sent buffer packet through dma
 *  channel1.
 */
#define SDIO_SLC1_TO_EOF_BFR_DES_ADDR    0xFFFFFFFFU
#define SDIO_SLC1_TO_EOF_BFR_DES_ADDR_M  (SDIO_SLC1_TO_EOF_BFR_DES_ADDR_V << SDIO_SLC1_TO_EOF_BFR_DES_ADDR_S)
#define SDIO_SLC1_TO_EOF_BFR_DES_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC1_TO_EOF_BFR_DES_ADDR_S  0

/** SDIO_SLC_AHB_TEST_REG register
 *  Sdio slave AHB test register.
 */
#define SDIO_SLC_AHB_TEST_REG (DR_REG_SLC_BASE + 0xa0)
/** SDIO_SLC_AHB_TESTMODE : R/W; bitpos: [2:0]; default: 0;
 *  set bit2 to 1 to enable sdio slave ahb test.
 */
#define SDIO_SLC_AHB_TESTMODE    0x00000007U
#define SDIO_SLC_AHB_TESTMODE_M  (SDIO_SLC_AHB_TESTMODE_V << SDIO_SLC_AHB_TESTMODE_S)
#define SDIO_SLC_AHB_TESTMODE_V  0x00000007U
#define SDIO_SLC_AHB_TESTMODE_S  0
/** SDIO_SLC_AHB_TESTADDR : R/W; bitpos: [5:4]; default: 0;
 *  Configure AHB test address.
 */
#define SDIO_SLC_AHB_TESTADDR    0x00000003U
#define SDIO_SLC_AHB_TESTADDR_M  (SDIO_SLC_AHB_TESTADDR_V << SDIO_SLC_AHB_TESTADDR_S)
#define SDIO_SLC_AHB_TESTADDR_V  0x00000003U
#define SDIO_SLC_AHB_TESTADDR_S  4

/** SDIO_SLC_SDIO_ST_REG register
 *  Sdio slave function status register.
 */
#define SDIO_SLC_SDIO_ST_REG (DR_REG_SLC_BASE + 0xa4)
/** SDIO_CMD_ST : RO; bitpos: [2:0]; default: 0;
 *  The sdio command fsm state.
 */
#define SDIO_CMD_ST    0x00000007U
#define SDIO_CMD_ST_M  (SDIO_CMD_ST_V << SDIO_CMD_ST_S)
#define SDIO_CMD_ST_V  0x00000007U
#define SDIO_CMD_ST_S  0
/** SDIO_FUNC_ST : RO; bitpos: [7:4]; default: 0;
 *  The sdio cmd52/53 function fsm state.
 */
#define SDIO_FUNC_ST    0x0000000FU
#define SDIO_FUNC_ST_M  (SDIO_FUNC_ST_V << SDIO_FUNC_ST_S)
#define SDIO_FUNC_ST_V  0x0000000FU
#define SDIO_FUNC_ST_S  4
/** SDIO_SDIO_WAKEUP : RO; bitpos: [8]; default: 0;
 *  reserved
 */
#define SDIO_SDIO_WAKEUP    (BIT(8))
#define SDIO_SDIO_WAKEUP_M  (SDIO_SDIO_WAKEUP_V << SDIO_SDIO_WAKEUP_S)
#define SDIO_SDIO_WAKEUP_V  0x00000001U
#define SDIO_SDIO_WAKEUP_S  8
/** SDIO_BUS_ST : RO; bitpos: [14:12]; default: 0;
 *  The sdio bus fsm state.
 */
#define SDIO_BUS_ST    0x00000007U
#define SDIO_BUS_ST_M  (SDIO_BUS_ST_V << SDIO_BUS_ST_S)
#define SDIO_BUS_ST_V  0x00000007U
#define SDIO_BUS_ST_S  12
/** SDIO_FUNC1_ACC_STATE : RO; bitpos: [20:16]; default: 0;
 *  The sdio func1 fsm state.
 */
#define SDIO_FUNC1_ACC_STATE    0x0000001FU
#define SDIO_FUNC1_ACC_STATE_M  (SDIO_FUNC1_ACC_STATE_V << SDIO_FUNC1_ACC_STATE_S)
#define SDIO_FUNC1_ACC_STATE_V  0x0000001FU
#define SDIO_FUNC1_ACC_STATE_S  16
/** SDIO_FUNC2_ACC_STATE : RO; bitpos: [28:24]; default: 0;
 *  The sdio func2 fsm state.
 */
#define SDIO_FUNC2_ACC_STATE    0x0000001FU
#define SDIO_FUNC2_ACC_STATE_M  (SDIO_FUNC2_ACC_STATE_V << SDIO_FUNC2_ACC_STATE_S)
#define SDIO_FUNC2_ACC_STATE_V  0x0000001FU
#define SDIO_FUNC2_ACC_STATE_S  24

/** SDIO_SLC_RX_DSCR_CONF_REG register
 *  Sdio slave sending descriptor configuration register.
 */
#define SDIO_SLC_RX_DSCR_CONF_REG (DR_REG_SLC_BASE + 0xa8)
/** SDIO_SLC0_TOKEN_NO_REPLACE : R/W; bitpos: [0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_TOKEN_NO_REPLACE    (BIT(0))
#define SDIO_SLC0_TOKEN_NO_REPLACE_M  (SDIO_SLC0_TOKEN_NO_REPLACE_V << SDIO_SLC0_TOKEN_NO_REPLACE_S)
#define SDIO_SLC0_TOKEN_NO_REPLACE_V  0x00000001U
#define SDIO_SLC0_TOKEN_NO_REPLACE_S  0
/** SDIO_SLC0_INFOR_NO_REPLACE : R/W; bitpos: [1]; default: 1;
 *  reserved
 */
#define SDIO_SLC0_INFOR_NO_REPLACE    (BIT(1))
#define SDIO_SLC0_INFOR_NO_REPLACE_M  (SDIO_SLC0_INFOR_NO_REPLACE_V << SDIO_SLC0_INFOR_NO_REPLACE_S)
#define SDIO_SLC0_INFOR_NO_REPLACE_V  0x00000001U
#define SDIO_SLC0_INFOR_NO_REPLACE_S  1
/** SDIO_SLC0_RX_FILL_MODE : R/W; bitpos: [2]; default: 0;
 *  slc0 rx pop end control: 0-automatically end when pop finish, 1- end when the next
 *  pop doesn't occur after 255 cycles since the current pop
 */
#define SDIO_SLC0_RX_FILL_MODE    (BIT(2))
#define SDIO_SLC0_RX_FILL_MODE_M  (SDIO_SLC0_RX_FILL_MODE_V << SDIO_SLC0_RX_FILL_MODE_S)
#define SDIO_SLC0_RX_FILL_MODE_V  0x00000001U
#define SDIO_SLC0_RX_FILL_MODE_S  2
/** SDIO_SLC0_RX_EOF_MODE : R/W; bitpos: [3]; default: 1;
 *  0-slc0 rx_push_eof, 1-slc0 rx_pop_eof
 */
#define SDIO_SLC0_RX_EOF_MODE    (BIT(3))
#define SDIO_SLC0_RX_EOF_MODE_M  (SDIO_SLC0_RX_EOF_MODE_V << SDIO_SLC0_RX_EOF_MODE_S)
#define SDIO_SLC0_RX_EOF_MODE_V  0x00000001U
#define SDIO_SLC0_RX_EOF_MODE_S  3
/** SDIO_SLC0_RX_FILL_EN : R/W; bitpos: [4]; default: 1;
 *  reserved
 */
#define SDIO_SLC0_RX_FILL_EN    (BIT(4))
#define SDIO_SLC0_RX_FILL_EN_M  (SDIO_SLC0_RX_FILL_EN_V << SDIO_SLC0_RX_FILL_EN_S)
#define SDIO_SLC0_RX_FILL_EN_V  0x00000001U
#define SDIO_SLC0_RX_FILL_EN_S  4
/** SDIO_SLC0_RD_RETRY_THRESHOLD : R/W; bitpos: [15:5]; default: 128;
 *  reserved
 */
#define SDIO_SLC0_RD_RETRY_THRESHOLD    0x000007FFU
#define SDIO_SLC0_RD_RETRY_THRESHOLD_M  (SDIO_SLC0_RD_RETRY_THRESHOLD_V << SDIO_SLC0_RD_RETRY_THRESHOLD_S)
#define SDIO_SLC0_RD_RETRY_THRESHOLD_V  0x000007FFU
#define SDIO_SLC0_RD_RETRY_THRESHOLD_S  5
/** SDIO_SLC1_TOKEN_NO_REPLACE : R/W; bitpos: [16]; default: 1;
 *  reserved
 */
#define SDIO_SLC1_TOKEN_NO_REPLACE    (BIT(16))
#define SDIO_SLC1_TOKEN_NO_REPLACE_M  (SDIO_SLC1_TOKEN_NO_REPLACE_V << SDIO_SLC1_TOKEN_NO_REPLACE_S)
#define SDIO_SLC1_TOKEN_NO_REPLACE_V  0x00000001U
#define SDIO_SLC1_TOKEN_NO_REPLACE_S  16
/** SDIO_SLC1_INFOR_NO_REPLACE : R/W; bitpos: [17]; default: 1;
 *  reserved
 */
#define SDIO_SLC1_INFOR_NO_REPLACE    (BIT(17))
#define SDIO_SLC1_INFOR_NO_REPLACE_M  (SDIO_SLC1_INFOR_NO_REPLACE_V << SDIO_SLC1_INFOR_NO_REPLACE_S)
#define SDIO_SLC1_INFOR_NO_REPLACE_V  0x00000001U
#define SDIO_SLC1_INFOR_NO_REPLACE_S  17
/** SDIO_SLC1_RX_FILL_MODE : R/W; bitpos: [18]; default: 0;
 *  slc1 rx pop end control: 0-automatically end when pop finish, 1- end when the next
 *  pop doesn't occur after 255 cycles since the current pop
 */
#define SDIO_SLC1_RX_FILL_MODE    (BIT(18))
#define SDIO_SLC1_RX_FILL_MODE_M  (SDIO_SLC1_RX_FILL_MODE_V << SDIO_SLC1_RX_FILL_MODE_S)
#define SDIO_SLC1_RX_FILL_MODE_V  0x00000001U
#define SDIO_SLC1_RX_FILL_MODE_S  18
/** SDIO_SLC1_RX_EOF_MODE : R/W; bitpos: [19]; default: 1;
 *  0-slc1 rx_push_eof, 1-slc1 rx_pop_eof
 */
#define SDIO_SLC1_RX_EOF_MODE    (BIT(19))
#define SDIO_SLC1_RX_EOF_MODE_M  (SDIO_SLC1_RX_EOF_MODE_V << SDIO_SLC1_RX_EOF_MODE_S)
#define SDIO_SLC1_RX_EOF_MODE_V  0x00000001U
#define SDIO_SLC1_RX_EOF_MODE_S  19
/** SDIO_SLC1_RX_FILL_EN : R/W; bitpos: [20]; default: 1;
 *  reserved
 */
#define SDIO_SLC1_RX_FILL_EN    (BIT(20))
#define SDIO_SLC1_RX_FILL_EN_M  (SDIO_SLC1_RX_FILL_EN_V << SDIO_SLC1_RX_FILL_EN_S)
#define SDIO_SLC1_RX_FILL_EN_V  0x00000001U
#define SDIO_SLC1_RX_FILL_EN_S  20
/** SDIO_SLC1_RD_RETRY_THRESHOLD : R/W; bitpos: [31:21]; default: 128;
 *  reserved
 */
#define SDIO_SLC1_RD_RETRY_THRESHOLD    0x000007FFU
#define SDIO_SLC1_RD_RETRY_THRESHOLD_M  (SDIO_SLC1_RD_RETRY_THRESHOLD_V << SDIO_SLC1_RD_RETRY_THRESHOLD_S)
#define SDIO_SLC1_RD_RETRY_THRESHOLD_V  0x000007FFU
#define SDIO_SLC1_RD_RETRY_THRESHOLD_S  21

