espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_reg.h
/** SDIO_SLC_SLC0_TXLINK_DSCR_REG register
 *  ******* Description ***********
 */
#define SDIO_SLC_SLC0_TXLINK_DSCR_REG (DR_REG_SLC_BASE + 0xac)
/** SDIO_SLC0_TXLINK_DSCR : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_TXLINK_DSCR    0xFFFFFFFFU
#define SDIO_SLC0_TXLINK_DSCR_M  (SDIO_SLC0_TXLINK_DSCR_V << SDIO_SLC0_TXLINK_DSCR_S)
#define SDIO_SLC0_TXLINK_DSCR_V  0xFFFFFFFFU
#define SDIO_SLC0_TXLINK_DSCR_S  0

/** SDIO_SLC_SLC0_TXLINK_DSCR_BF0_REG register
 *  ******* Description ***********
 */
#define SDIO_SLC_SLC0_TXLINK_DSCR_BF0_REG (DR_REG_SLC_BASE + 0xb0)
/** SDIO_SLC0_TXLINK_DSCR_BF0 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_TXLINK_DSCR_BF0    0xFFFFFFFFU
#define SDIO_SLC0_TXLINK_DSCR_BF0_M  (SDIO_SLC0_TXLINK_DSCR_BF0_V << SDIO_SLC0_TXLINK_DSCR_BF0_S)
#define SDIO_SLC0_TXLINK_DSCR_BF0_V  0xFFFFFFFFU
#define SDIO_SLC0_TXLINK_DSCR_BF0_S  0

/** SDIO_SLC_SLC0_TXLINK_DSCR_BF1_REG register
 *  reserved
 */
#define SDIO_SLC_SLC0_TXLINK_DSCR_BF1_REG (DR_REG_SLC_BASE + 0xb4)
/** SDIO_SLC0_TXLINK_DSCR_BF1 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_TXLINK_DSCR_BF1    0xFFFFFFFFU
#define SDIO_SLC0_TXLINK_DSCR_BF1_M  (SDIO_SLC0_TXLINK_DSCR_BF1_V << SDIO_SLC0_TXLINK_DSCR_BF1_S)
#define SDIO_SLC0_TXLINK_DSCR_BF1_V  0xFFFFFFFFU
#define SDIO_SLC0_TXLINK_DSCR_BF1_S  0

/** SDIO_SLC_SLC0_RXLINK_DSCR_REG register
 *  ******* Description ***********
 */
#define SDIO_SLC_SLC0_RXLINK_DSCR_REG (DR_REG_SLC_BASE + 0xb8)
/** SDIO_SLC0_RXLINK_DSCR : RO; bitpos: [31:0]; default: 0;
 *  the third word of slc0 link descriptor, or known as the next descriptor address
 */
#define SDIO_SLC0_RXLINK_DSCR    0xFFFFFFFFU
#define SDIO_SLC0_RXLINK_DSCR_M  (SDIO_SLC0_RXLINK_DSCR_V << SDIO_SLC0_RXLINK_DSCR_S)
#define SDIO_SLC0_RXLINK_DSCR_V  0xFFFFFFFFU
#define SDIO_SLC0_RXLINK_DSCR_S  0

/** SDIO_SLC_SLC0_RXLINK_DSCR_BF0_REG register
 *  ******* Description ***********
 */
#define SDIO_SLC_SLC0_RXLINK_DSCR_BF0_REG (DR_REG_SLC_BASE + 0xbc)
/** SDIO_SLC0_RXLINK_DSCR_BF0 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_RXLINK_DSCR_BF0    0xFFFFFFFFU
#define SDIO_SLC0_RXLINK_DSCR_BF0_M  (SDIO_SLC0_RXLINK_DSCR_BF0_V << SDIO_SLC0_RXLINK_DSCR_BF0_S)
#define SDIO_SLC0_RXLINK_DSCR_BF0_V  0xFFFFFFFFU
#define SDIO_SLC0_RXLINK_DSCR_BF0_S  0

/** SDIO_SLC_SLC0_RXLINK_DSCR_BF1_REG register
 *  reserved
 */
#define SDIO_SLC_SLC0_RXLINK_DSCR_BF1_REG (DR_REG_SLC_BASE + 0xc0)
/** SDIO_SLC0_RXLINK_DSCR_BF1 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_RXLINK_DSCR_BF1    0xFFFFFFFFU
#define SDIO_SLC0_RXLINK_DSCR_BF1_M  (SDIO_SLC0_RXLINK_DSCR_BF1_V << SDIO_SLC0_RXLINK_DSCR_BF1_S)
#define SDIO_SLC0_RXLINK_DSCR_BF1_V  0xFFFFFFFFU
#define SDIO_SLC0_RXLINK_DSCR_BF1_S  0

/** SDIO_SLC_SLC1_TXLINK_DSCR_REG register
 *  reserved
 */
#define SDIO_SLC_SLC1_TXLINK_DSCR_REG (DR_REG_SLC_BASE + 0xc4)
/** SDIO_SLC1_TXLINK_DSCR : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TXLINK_DSCR    0xFFFFFFFFU
#define SDIO_SLC1_TXLINK_DSCR_M  (SDIO_SLC1_TXLINK_DSCR_V << SDIO_SLC1_TXLINK_DSCR_S)
#define SDIO_SLC1_TXLINK_DSCR_V  0xFFFFFFFFU
#define SDIO_SLC1_TXLINK_DSCR_S  0

/** SDIO_SLC_SLC1_TXLINK_DSCR_BF0_REG register
 *  reserved
 */
#define SDIO_SLC_SLC1_TXLINK_DSCR_BF0_REG (DR_REG_SLC_BASE + 0xc8)
/** SDIO_SLC1_TXLINK_DSCR_BF0 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TXLINK_DSCR_BF0    0xFFFFFFFFU
#define SDIO_SLC1_TXLINK_DSCR_BF0_M  (SDIO_SLC1_TXLINK_DSCR_BF0_V << SDIO_SLC1_TXLINK_DSCR_BF0_S)
#define SDIO_SLC1_TXLINK_DSCR_BF0_V  0xFFFFFFFFU
#define SDIO_SLC1_TXLINK_DSCR_BF0_S  0

/** SDIO_SLC_SLC1_TXLINK_DSCR_BF1_REG register
 *  reserved
 */
#define SDIO_SLC_SLC1_TXLINK_DSCR_BF1_REG (DR_REG_SLC_BASE + 0xcc)
/** SDIO_SLC1_TXLINK_DSCR_BF1 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TXLINK_DSCR_BF1    0xFFFFFFFFU
#define SDIO_SLC1_TXLINK_DSCR_BF1_M  (SDIO_SLC1_TXLINK_DSCR_BF1_V << SDIO_SLC1_TXLINK_DSCR_BF1_S)
#define SDIO_SLC1_TXLINK_DSCR_BF1_V  0xFFFFFFFFU
#define SDIO_SLC1_TXLINK_DSCR_BF1_S  0

/** SDIO_SLC_SLC1_RXLINK_DSCR_REG register
 *  ******* Description ***********
 */
#define SDIO_SLC_SLC1_RXLINK_DSCR_REG (DR_REG_SLC_BASE + 0xd0)
/** SDIO_SLC1_RXLINK_DSCR : RO; bitpos: [31:0]; default: 0;
 *  the third word of slc1 link descriptor, or known as the next descriptor address
 */
#define SDIO_SLC1_RXLINK_DSCR    0xFFFFFFFFU
#define SDIO_SLC1_RXLINK_DSCR_M  (SDIO_SLC1_RXLINK_DSCR_V << SDIO_SLC1_RXLINK_DSCR_S)
#define SDIO_SLC1_RXLINK_DSCR_V  0xFFFFFFFFU
#define SDIO_SLC1_RXLINK_DSCR_S  0

/** SDIO_SLC_SLC1_RXLINK_DSCR_BF0_REG register
 *  ******* Description ***********
 */
#define SDIO_SLC_SLC1_RXLINK_DSCR_BF0_REG (DR_REG_SLC_BASE + 0xd4)
/** SDIO_SLC1_RXLINK_DSCR_BF0 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RXLINK_DSCR_BF0    0xFFFFFFFFU
#define SDIO_SLC1_RXLINK_DSCR_BF0_M  (SDIO_SLC1_RXLINK_DSCR_BF0_V << SDIO_SLC1_RXLINK_DSCR_BF0_S)
#define SDIO_SLC1_RXLINK_DSCR_BF0_V  0xFFFFFFFFU
#define SDIO_SLC1_RXLINK_DSCR_BF0_S  0

/** SDIO_SLC_SLC1_RXLINK_DSCR_BF1_REG register
 *  reserved
 */
#define SDIO_SLC_SLC1_RXLINK_DSCR_BF1_REG (DR_REG_SLC_BASE + 0xd8)
/** SDIO_SLC1_RXLINK_DSCR_BF1 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_RXLINK_DSCR_BF1    0xFFFFFFFFU
#define SDIO_SLC1_RXLINK_DSCR_BF1_M  (SDIO_SLC1_RXLINK_DSCR_BF1_V << SDIO_SLC1_RXLINK_DSCR_BF1_S)
#define SDIO_SLC1_RXLINK_DSCR_BF1_V  0xFFFFFFFFU
#define SDIO_SLC1_RXLINK_DSCR_BF1_S  0

/** SDIO_SLC_SLC0_TX_ERREOF_DES_ADDR_REG register
 *  reserved
 */
#define SDIO_SLC_SLC0_TX_ERREOF_DES_ADDR_REG (DR_REG_SLC_BASE + 0xdc)
/** SDIO_SLC0_TX_ERR_EOF_DES_ADDR : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_TX_ERR_EOF_DES_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_TX_ERR_EOF_DES_ADDR_M  (SDIO_SLC0_TX_ERR_EOF_DES_ADDR_V << SDIO_SLC0_TX_ERR_EOF_DES_ADDR_S)
#define SDIO_SLC0_TX_ERR_EOF_DES_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_TX_ERR_EOF_DES_ADDR_S  0

/** SDIO_SLC_SLC1_TX_ERREOF_DES_ADDR_REG register
 *  reserved
 */
#define SDIO_SLC_SLC1_TX_ERREOF_DES_ADDR_REG (DR_REG_SLC_BASE + 0xe0)
/** SDIO_SLC1_TX_ERR_EOF_DES_ADDR : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TX_ERR_EOF_DES_ADDR    0xFFFFFFFFU
#define SDIO_SLC1_TX_ERR_EOF_DES_ADDR_M  (SDIO_SLC1_TX_ERR_EOF_DES_ADDR_V << SDIO_SLC1_TX_ERR_EOF_DES_ADDR_S)
#define SDIO_SLC1_TX_ERR_EOF_DES_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC1_TX_ERR_EOF_DES_ADDR_S  0

/** SDIO_SLC_TOKEN_LAT_REG register
 *  reserved
 */
#define SDIO_SLC_TOKEN_LAT_REG (DR_REG_SLC_BASE + 0xe4)
/** SDIO_SLC0_TOKEN : RO; bitpos: [11:0]; default: 0;
 *  reserved
 */
#define SDIO_SLC0_TOKEN    0x00000FFFU
#define SDIO_SLC0_TOKEN_M  (SDIO_SLC0_TOKEN_V << SDIO_SLC0_TOKEN_S)
#define SDIO_SLC0_TOKEN_V  0x00000FFFU
#define SDIO_SLC0_TOKEN_S  0
/** SDIO_SLC1_TOKEN : RO; bitpos: [27:16]; default: 0;
 *  reserved
 */
#define SDIO_SLC1_TOKEN    0x00000FFFU
#define SDIO_SLC1_TOKEN_M  (SDIO_SLC1_TOKEN_V << SDIO_SLC1_TOKEN_S)
#define SDIO_SLC1_TOKEN_V  0x00000FFFU
#define SDIO_SLC1_TOKEN_S  16

/** SDIO_SLC_TX_DSCR_CONF_REG register
 *  reserved
 */
#define SDIO_SLC_TX_DSCR_CONF_REG (DR_REG_SLC_BASE + 0xe8)
/** SDIO_SLC_WR_RETRY_THRESHOLD : R/W; bitpos: [10:0]; default: 128;
 *  reserved
 */
#define SDIO_SLC_WR_RETRY_THRESHOLD    0x000007FFU
#define SDIO_SLC_WR_RETRY_THRESHOLD_M  (SDIO_SLC_WR_RETRY_THRESHOLD_V << SDIO_SLC_WR_RETRY_THRESHOLD_S)
#define SDIO_SLC_WR_RETRY_THRESHOLD_V  0x000007FFU
#define SDIO_SLC_WR_RETRY_THRESHOLD_S  0

/** SDIO_SLC_CMD_INFOR0_REG register
 *  reserved
 */
#define SDIO_SLC_CMD_INFOR0_REG (DR_REG_SLC_BASE + 0xec)
/** SDIO_CMD_CONTENT0 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_CMD_CONTENT0    0xFFFFFFFFU
#define SDIO_CMD_CONTENT0_M  (SDIO_CMD_CONTENT0_V << SDIO_CMD_CONTENT0_S)
#define SDIO_CMD_CONTENT0_V  0xFFFFFFFFU
#define SDIO_CMD_CONTENT0_S  0

/** SDIO_SLC_CMD_INFOR1_REG register
 *  reserved
 */
#define SDIO_SLC_CMD_INFOR1_REG (DR_REG_SLC_BASE + 0xf0)
/** SDIO_CMD_CONTENT1 : RO; bitpos: [31:0]; default: 0;
 *  reserved
 */
#define SDIO_CMD_CONTENT1    0xFFFFFFFFU
#define SDIO_CMD_CONTENT1_M  (SDIO_CMD_CONTENT1_V << SDIO_CMD_CONTENT1_S)
#define SDIO_CMD_CONTENT1_V  0xFFFFFFFFU
#define SDIO_CMD_CONTENT1_S  0

