espressif/esp-idf/components/soc/esp32c61/register/soc/sdio_slc_reg.h
/** SDIO_SLC_SLC0_RXPKT_E_DSCR_REG register
 *  Sdio slave DMA channel0 end address of sending linked list register.
 */
#define SDIO_SLC_SLC0_RXPKT_E_DSCR_REG (DR_REG_SLC_BASE + 0x108)
/** SDIO_SLC0_RX_PKT_E_DSCR_ADDR : R/W; bitpos: [31:0]; default: 0;
 *  Configure the end address of sending linked list to be stitched to the current
 *  linked list of dma channel0.
 */
#define SDIO_SLC0_RX_PKT_E_DSCR_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_RX_PKT_E_DSCR_ADDR_M  (SDIO_SLC0_RX_PKT_E_DSCR_ADDR_V << SDIO_SLC0_RX_PKT_E_DSCR_ADDR_S)
#define SDIO_SLC0_RX_PKT_E_DSCR_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_RX_PKT_E_DSCR_ADDR_S  0

/** SDIO_SLC_SLC0_TXPKTU_H_DSCR_REG register
 *  Sdio slave DMA channel0 start address of receiving linked list status register.
 */
#define SDIO_SLC_SLC0_TXPKTU_H_DSCR_REG (DR_REG_SLC_BASE + 0x10c)
/** SDIO_SLC0_TX_PKT_START_DSCR_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The start address of the linked list of the last received packet through dma
 *  channel0.
 */
#define SDIO_SLC0_TX_PKT_START_DSCR_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_TX_PKT_START_DSCR_ADDR_M  (SDIO_SLC0_TX_PKT_START_DSCR_ADDR_V << SDIO_SLC0_TX_PKT_START_DSCR_ADDR_S)
#define SDIO_SLC0_TX_PKT_START_DSCR_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_TX_PKT_START_DSCR_ADDR_S  0

/** SDIO_SLC_SLC0_TXPKTU_E_DSCR_REG register
 *  Sdio slave DMA channel0 end address of receiving linked list status register.
 */
#define SDIO_SLC_SLC0_TXPKTU_E_DSCR_REG (DR_REG_SLC_BASE + 0x110)
/** SDIO_SLC0_TX_PKT_END_DSCR_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The end address of the linked list of the last received packet through dma channel0.
 */
#define SDIO_SLC0_TX_PKT_END_DSCR_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_TX_PKT_END_DSCR_ADDR_M  (SDIO_SLC0_TX_PKT_END_DSCR_ADDR_V << SDIO_SLC0_TX_PKT_END_DSCR_ADDR_S)
#define SDIO_SLC0_TX_PKT_END_DSCR_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_TX_PKT_END_DSCR_ADDR_S  0

/** SDIO_SLC_SLC0_RXPKTU_H_DSCR_REG register
 *  Sdio slave DMA channel0 start address of sending linked list status register.
 */
#define SDIO_SLC_SLC0_RXPKTU_H_DSCR_REG (DR_REG_SLC_BASE + 0x114)
/** SDIO_SLC0_RX_PKT_START_DSCR_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The start address of the linked list of the last sent packet through dma channel0.
 */
#define SDIO_SLC0_RX_PKT_START_DSCR_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_RX_PKT_START_DSCR_ADDR_M  (SDIO_SLC0_RX_PKT_START_DSCR_ADDR_V << SDIO_SLC0_RX_PKT_START_DSCR_ADDR_S)
#define SDIO_SLC0_RX_PKT_START_DSCR_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_RX_PKT_START_DSCR_ADDR_S  0

/** SDIO_SLC_SLC0_RXPKTU_E_DSCR_REG register
 *  Sdio slave DMA channel0 end address of sending linked list status register.
 */
#define SDIO_SLC_SLC0_RXPKTU_E_DSCR_REG (DR_REG_SLC_BASE + 0x118)
/** SDIO_SLC0_RX_PKT_END_DSCR_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The end address of the linked list of the last sent packet through dma channel0.
 */
#define SDIO_SLC0_RX_PKT_END_DSCR_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_RX_PKT_END_DSCR_ADDR_M  (SDIO_SLC0_RX_PKT_END_DSCR_ADDR_V << SDIO_SLC0_RX_PKT_END_DSCR_ADDR_S)
#define SDIO_SLC0_RX_PKT_END_DSCR_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_RX_PKT_END_DSCR_ADDR_S  0

/** SDIO_SLC_SEQ_POSITION_REG register
 *  The position of receiving packet configuration register.
 */
#define SDIO_SLC_SEQ_POSITION_REG (DR_REG_SLC_BASE + 0x11c)
/** SDIO_SLC0_SEQ_POSITION : R/W; bitpos: [7:0]; default: 9;
 *  Configure the position of the receiving packet through dma channel0.
 */
#define SDIO_SLC0_SEQ_POSITION    0x000000FFU
#define SDIO_SLC0_SEQ_POSITION_M  (SDIO_SLC0_SEQ_POSITION_V << SDIO_SLC0_SEQ_POSITION_S)
#define SDIO_SLC0_SEQ_POSITION_V  0x000000FFU
#define SDIO_SLC0_SEQ_POSITION_S  0
/** SDIO_SLC1_SEQ_POSITION : R/W; bitpos: [15:8]; default: 5;
 *  Configure the position of the receiving packet through dma channel1.
 */
#define SDIO_SLC1_SEQ_POSITION    0x000000FFU
#define SDIO_SLC1_SEQ_POSITION_M  (SDIO_SLC1_SEQ_POSITION_V << SDIO_SLC1_SEQ_POSITION_S)
#define SDIO_SLC1_SEQ_POSITION_V  0x000000FFU
#define SDIO_SLC1_SEQ_POSITION_S  8

/** SDIO_SLC_SLC0_DSCR_REC_CONF_REG register
 *  Sdio slave DMA sending linked list limit configuration register.
 */
#define SDIO_SLC_SLC0_DSCR_REC_CONF_REG (DR_REG_SLC_BASE + 0x120)
/** SDIO_SLC0_RX_DSCR_REC_LIM : R/W; bitpos: [9:0]; default: 1023;
 *  Configure the limit number of descriptors used to send one packet through dma
 *  channel0 in stitch mode.
 */
#define SDIO_SLC0_RX_DSCR_REC_LIM    0x000003FFU
#define SDIO_SLC0_RX_DSCR_REC_LIM_M  (SDIO_SLC0_RX_DSCR_REC_LIM_V << SDIO_SLC0_RX_DSCR_REC_LIM_S)
#define SDIO_SLC0_RX_DSCR_REC_LIM_V  0x000003FFU
#define SDIO_SLC0_RX_DSCR_REC_LIM_S  0

/** SDIO_SLC_SDIO_CRC_ST0_REG register
 *  Sdio slave receiving packet data crc status register.
 */
#define SDIO_SLC_SDIO_CRC_ST0_REG (DR_REG_SLC_BASE + 0x124)
/** SDIO_DAT0_CRC_ERR_CNT : RO; bitpos: [7:0]; default: 0;
 *  The count value of received packet data crc errors on sd_data0 line.
 */
#define SDIO_DAT0_CRC_ERR_CNT    0x000000FFU
#define SDIO_DAT0_CRC_ERR_CNT_M  (SDIO_DAT0_CRC_ERR_CNT_V << SDIO_DAT0_CRC_ERR_CNT_S)
#define SDIO_DAT0_CRC_ERR_CNT_V  0x000000FFU
#define SDIO_DAT0_CRC_ERR_CNT_S  0
/** SDIO_DAT1_CRC_ERR_CNT : RO; bitpos: [15:8]; default: 0;
 *  The count value of received packet data crc errors on sd_data1 line.
 */
#define SDIO_DAT1_CRC_ERR_CNT    0x000000FFU
#define SDIO_DAT1_CRC_ERR_CNT_M  (SDIO_DAT1_CRC_ERR_CNT_V << SDIO_DAT1_CRC_ERR_CNT_S)
#define SDIO_DAT1_CRC_ERR_CNT_V  0x000000FFU
#define SDIO_DAT1_CRC_ERR_CNT_S  8
/** SDIO_DAT2_CRC_ERR_CNT : RO; bitpos: [23:16]; default: 0;
 *  The count value of received packet data crc errors on sd_data2 line.
 */
#define SDIO_DAT2_CRC_ERR_CNT    0x000000FFU
#define SDIO_DAT2_CRC_ERR_CNT_M  (SDIO_DAT2_CRC_ERR_CNT_V << SDIO_DAT2_CRC_ERR_CNT_S)
#define SDIO_DAT2_CRC_ERR_CNT_V  0x000000FFU
#define SDIO_DAT2_CRC_ERR_CNT_S  16
/** SDIO_DAT3_CRC_ERR_CNT : RO; bitpos: [31:24]; default: 0;
 *  The count value of received packet data crc errors on sd_data3 line.
 */
#define SDIO_DAT3_CRC_ERR_CNT    0x000000FFU
#define SDIO_DAT3_CRC_ERR_CNT_M  (SDIO_DAT3_CRC_ERR_CNT_V << SDIO_DAT3_CRC_ERR_CNT_S)
#define SDIO_DAT3_CRC_ERR_CNT_V  0x000000FFU
#define SDIO_DAT3_CRC_ERR_CNT_S  24

/** SDIO_SLC_SDIO_CRC_ST1_REG register
 *  Sdio slave receiving command crc status register.
 */
#define SDIO_SLC_SDIO_CRC_ST1_REG (DR_REG_SLC_BASE + 0x128)
/** SDIO_CMD_CRC_ERR_CNT : RO; bitpos: [7:0]; default: 0;
 *  The count value of received command crc errors.
 */
#define SDIO_CMD_CRC_ERR_CNT    0x000000FFU
#define SDIO_CMD_CRC_ERR_CNT_M  (SDIO_CMD_CRC_ERR_CNT_V << SDIO_CMD_CRC_ERR_CNT_S)
#define SDIO_CMD_CRC_ERR_CNT_V  0x000000FFU
#define SDIO_CMD_CRC_ERR_CNT_S  0
/** SDIO_ERR_CNT_CLR : R/W; bitpos: [31]; default: 0;
 *  Set 1 to clear the cmd_crc_err_cnt, dat0_crc_err_cnt, dat1_crc_err_cnt,
 *  dat2_crc_err_cnt and dat3_crc_err_cnt.
 */
#define SDIO_ERR_CNT_CLR    (BIT(31))
#define SDIO_ERR_CNT_CLR_M  (SDIO_ERR_CNT_CLR_V << SDIO_ERR_CNT_CLR_S)
#define SDIO_ERR_CNT_CLR_V  0x00000001U
#define SDIO_ERR_CNT_CLR_S  31

/** SDIO_SLC_SLC0_EOF_START_DES_REG register
 *  Sdio slave DMA channel0 start address of sending linked list status register.
 */
#define SDIO_SLC_SLC0_EOF_START_DES_REG (DR_REG_SLC_BASE + 0x12c)
/** SDIO_SLC0_EOF_START_DES_ADDR : RO; bitpos: [31:0]; default: 0;
 *  The start address of the linked list of the last sent packet through dma channel0.
 */
#define SDIO_SLC0_EOF_START_DES_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_EOF_START_DES_ADDR_M  (SDIO_SLC0_EOF_START_DES_ADDR_V << SDIO_SLC0_EOF_START_DES_ADDR_S)
#define SDIO_SLC0_EOF_START_DES_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_EOF_START_DES_ADDR_S  0

/** SDIO_SLC_SLC0_PUSH_DSCR_ADDR_REG register
 *  Sdio slave DMA channel0 address of sending linked list status register.
 */
#define SDIO_SLC_SLC0_PUSH_DSCR_ADDR_REG (DR_REG_SLC_BASE + 0x130)
/** SDIO_SLC0_RX_PUSH_DSCR_ADDR : RO; bitpos: [31:0]; default: 0;
 *  the current descriptor address when slc0 gets a link descriptor, aligned with word
 */
#define SDIO_SLC0_RX_PUSH_DSCR_ADDR    0xFFFFFFFFU
#define SDIO_SLC0_RX_PUSH_DSCR_ADDR_M  (SDIO_SLC0_RX_PUSH_DSCR_ADDR_V << SDIO_SLC0_RX_PUSH_DSCR_ADDR_S)
#define SDIO_SLC0_RX_PUSH_DSCR_ADDR_V  0xFFFFFFFFU
#define SDIO_SLC0_RX_PUSH_DSCR_ADDR_S  0

